[
  {
    "id": "1m8v66f",
    "subreddit": "wallstreetbets",
    "title": "Daily Discussion Thread for July 25, 2025",
    "selftext": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/wallstreetbets/comments/1m8v66f)",
    "created_utc": 1753437733.0,
    "score": 283,
    "num_comments": 8580,
    "author": "wsbapp",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/1m8v66f/daily_discussion_thread_for_july_25_2025/",
    "permalink": "/r/wallstreetbets/comments/1m8v66f/daily_discussion_thread_for_july_25_2025/",
    "timestamp": "2025-07-25T10:02:13Z",
    "ticker": null
  },
  {
    "id": "1m8zdo1",
    "subreddit": "wallstreetbets",
    "title": "Weekly Earnings Thread 7/28 - 8/1",
    "selftext": "",
    "created_utc": 1753450621.0,
    "score": 122,
    "num_comments": 151,
    "author": "OSRSkarma",
    "url": "https://i.redd.it/jj477h3yw0ff1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m8zdo1/weekly_earnings_thread_728_81/",
    "timestamp": "2025-07-25T13:37:01Z",
    "ticker": null
  },
  {
    "id": "1m8fslr",
    "subreddit": "wallstreetbets",
    "title": "Basically",
    "selftext": "",
    "created_utc": 1753389925.0,
    "score": 31142,
    "num_comments": 516,
    "author": "unwritten6c",
    "url": "https://i.redd.it/bojoaergwvef1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m8fslr/basically/",
    "timestamp": "2025-07-24T20:45:25Z",
    "ticker": null
  },
  {
    "id": "1m91q4e",
    "subreddit": "wallstreetbets",
    "title": "Intel what have you done?",
    "selftext": "Should have sold yesterday AH when it popped 7%. Now a bag holder. ",
    "created_utc": 1753456197.0,
    "score": 373,
    "num_comments": 175,
    "author": "Ok_Environment_3618",
    "url": "https://i.redd.it/l0x8kkwid1ff1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m91q4e/intel_what_have_you_done/",
    "timestamp": "2025-07-25T15:09:57Z",
    "ticker": null
  },
  {
    "id": "1m947td",
    "subreddit": "wallstreetbets",
    "title": "I DNUT expect this",
    "selftext": "Reread Benjamin Graham’s The Intelligent Investor and I am now a long term $DNUT options holder. I need everyone to go purchase donuts every morning until earnings yo raise guidance.\nTHANK YOU FOR YOUR ATTENTION TO THIS MATTER.\nLooks a little worse because I took out 80k.\n",
    "created_utc": 1753461860.0,
    "score": 171,
    "num_comments": 64,
    "author": "Phazem",
    "url": "https://www.reddit.com/gallery/1m947td",
    "permalink": "/r/wallstreetbets/comments/1m947td/i_dnut_expect_this/",
    "timestamp": "2025-07-25T16:44:20Z",
    "ticker": null
  },
  {
    "id": "1m8gd0p",
    "subreddit": "wallstreetbets",
    "title": "What was really said 💬",
    "selftext": "What most of us heard",
    "created_utc": 1753391262.0,
    "score": 7110,
    "num_comments": 308,
    "author": "Hamood3",
    "url": "https://i.redd.it/xy93rguf0wef1.gif",
    "permalink": "/r/wallstreetbets/comments/1m8gd0p/what_was_really_said/",
    "timestamp": "2025-07-24T21:07:42Z",
    "ticker": null
  },
  {
    "id": "1m8kuwn",
    "subreddit": "wallstreetbets",
    "title": "Intel reveals it will shed 24,000 employees this year and retreat in Germany, Poland, and Costa Rica",
    "selftext": "",
    "created_utc": 1753402885.0,
    "score": 2703,
    "num_comments": 252,
    "author": "skysurfguy1213",
    "url": "https://www.theverge.com/news/713388/intel-q2-2025-leave-germany-poland-costa-rica",
    "permalink": "/r/wallstreetbets/comments/1m8kuwn/intel_reveals_it_will_shed_24000_employees_this/",
    "timestamp": "2025-07-25T00:21:25Z",
    "ticker": null
  },
  {
    "id": "1m8qmhj",
    "subreddit": "wallstreetbets",
    "title": "Buying big OTM TSLA calls since January. Now have to file for bankruptcy.",
    "selftext": "",
    "created_utc": 1753420359.0,
    "score": 1033,
    "num_comments": 241,
    "author": "mgss47788999",
    "url": "https://i.redd.it/jxinoflyeyef1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m8qmhj/buying_big_otm_tsla_calls_since_january_now_have/",
    "timestamp": "2025-07-25T05:12:39Z",
    "ticker": null
  },
  {
    "id": "1m8n9wv",
    "subreddit": "wallstreetbets",
    "title": "AI eating up google's search business",
    "selftext": "",
    "created_utc": 1753409833.0,
    "score": 1630,
    "num_comments": 225,
    "author": "Initial-leo5555",
    "url": "https://i.redd.it/20ipa6onjxef1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m8n9wv/ai_eating_up_googles_search_business/",
    "timestamp": "2025-07-25T02:17:13Z",
    "ticker": null
  },
  {
    "id": "1m8wwuz",
    "subreddit": "wallstreetbets",
    "title": "AMPX DD - Batteries that will (literally) take us to the moon",
    "selftext": "Hi Degens: long time lurker, first time poster with some DD. I tried to post this a couple of weeks ago but didn’t have enough karma. (Sucks for all of you cause the stock has had a great run) Read, roast me, or scroll past, but here’s why I’m bullish AF.\n\nTLDR: Amprius makes silicon anode batteries that destroy traditional lithium-ion cells in every performance metric. They’re already shipping to defense and aerospace clients (think drones, UAVs, etc.) and drones are so hot right now.\n\nLet’s get this out of the way first: Amprius makes silicon anode lithium batteries. Not fancy-sounding “solid state” science projects that need 7 more years in a lab. These batteries actually work, are in production, and are already in the field. Oh and also, they are best in class. \n\nEnergy Density: 2x traditional lithium. Charge Time: as low as 6 minutes. Weight: 50% lighter. Cycle Life: This is the theoretical problem with silicon anodes which has stopped them from being mass-produced. Amprius has figured out a way to get 500 cycles and it’s been improving.\n\nIf you want longer range, lighter aircraft, faster charge, and a power source that doesn’t need its own backpack, you want this.\n\nThese are not hypothetical specs. Drone manufacturers are already using them. Reddit reviews say that these batteries are blowing peoples minds.\n\nWHY NOW?: UAVs, Defense Spending, and a War-Obsessed World\n\nLet’s talk macro: The world is falling apart and every major power is funneling cash into defense tech like it’s 1942.\n\nUAVs and drones are so hot right now. They are the future of war. Read the many DDs of drone companies all over Reddit.\n\nDrones need light, energy dense, ultra-fast-charging batteries.\n\nUS Defense Dept. has already awarded Amprius contracts.\n\n“We need 500 Wh/kg batteries for tactical edge UAVs.” -The Pentagon, probably\n\nAdd: Rising global tension (Middle east, China, Ukraine) Shift toward electrification of everything in combat=Near-term demand for lightweight, high-performance batteries\n\nAnd you’ve got the perfect storm for Amprius to dominate military battery tech.\n\nAnd what if…EVs?\n\nSilicon anode batteries are the holy grail of EVs. Double the range, Half the weight, Full charge while you refill your coffee.\n\nEV makers are all chasing new battery technology. Tesla has talked about it for years, and other OEMs are investing billions in R&D.\n\nBut guess what?\n\nAmprius already cracked it. They just need scale.\n\nTheir roadmap includes expansion into automotive-scale production by 2026–2027. They’re currently sampling cells to automakers, and pilot programs are underway.\n\nThis is the classic “picks and shovels” play. catch them before they hit the big leagues.\n\nAnd they have actual sales: This Ain’t a Science Fair Project\n\nRevenue is already ramping: Q1 2024: Revenue up 225% YoY , Multiple new clients added in aerospace, drones, and defense. They literally can’t make these batteries fast enough, and have partnered with manufacturers in South Korea for extra capacity.\n\n2025 and 2026 will be inflection years as new facilities go online.\n\nAlso: Insiders are NOT selling. In fact, there’ve been multiple buys and strategic investments in recent months.\n\nThis is not a pump and dump dead company or some bs startup selling a ChatGpt wrapper. This is a real company, shipping a real, game-changing product, with: Massive tailwinds from global defense spending, A potential EV expansion catalyst, Crazy asymmetric upside from a $900 market cap and oh yeah… they have no meaningful competition. There are a couple other companies trying to crack silicon but Amprius already has.\n\nMost recent analyst price target is $15. And analysts, as we know, are never wrong.\n\nTHE RISKS (Because I’m probably a Degenerate) Production scale risk: Can they actually build enough? Competition: Big dogs like Tesla/Panasonic could play catch-up. Battery industry is cutthroat and capex-heavy. Still not profitable (this is WSB, do we care?)\n\nBut remember, we’re early. Like pre-Model S Tesla early.\n\nBuy a few shares. Forget about them. Come back when your fridge has a drone delivering your groceries, and it’s powered by Amprius. \n\nPositions: Long (obviously) 3000 shares. NFA. I’m just a degenerate and drone enthusiast. DYOR. Don’t invest more than you can afford to lose, but be prepared to win.\n\n",
    "created_utc": 1753443787.0,
    "score": 171,
    "num_comments": 80,
    "author": "nicecatdev",
    "url": "https://i.redd.it/9s1vuihmc0ff1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m8wwuz/ampx_dd_batteries_that_will_literally_take_us_to/",
    "timestamp": "2025-07-25T11:43:07Z",
    "ticker": null
  },
  {
    "id": "1m8zias",
    "subreddit": "wallstreetbets",
    "title": "Wish this old bear some luck please",
    "selftext": "29k in puts",
    "created_utc": 1753450937.0,
    "score": 84,
    "num_comments": 76,
    "author": "kananishino",
    "url": "https://www.reddit.com/gallery/1m8zias",
    "permalink": "/r/wallstreetbets/comments/1m8zias/wish_this_old_bear_some_luck_please/",
    "timestamp": "2025-07-25T13:42:17Z",
    "ticker": null
  },
  {
    "id": "1m8a5ao",
    "subreddit": "wallstreetbets",
    "title": "My dad gave me control of his Robinhood account, here are some of his losses..",
    "selftext": "",
    "created_utc": 1753376962.0,
    "score": 3197,
    "num_comments": 833,
    "author": "Beautiful-Cress5695",
    "url": "https://www.reddit.com/gallery/1m8a5ao",
    "permalink": "/r/wallstreetbets/comments/1m8a5ao/my_dad_gave_me_control_of_his_robinhood_account/",
    "timestamp": "2025-07-24T17:09:22Z",
    "ticker": null
  },
  {
    "id": "1m8hge6",
    "subreddit": "wallstreetbets",
    "title": "Finally broke even 400k > 50k > 500k",
    "selftext": "After 4 years of being negative, I've finally broke even! Years of persevering made it worth it! Been called a regard by my friends long enough. Look who's laughing now!",
    "created_utc": 1753393932.0,
    "score": 945,
    "num_comments": 179,
    "author": "bunbotman990",
    "url": "https://www.reddit.com/gallery/1m8hge6",
    "permalink": "/r/wallstreetbets/comments/1m8hge6/finally_broke_even_400k_50k_500k/",
    "timestamp": "2025-07-24T21:52:12Z",
    "ticker": null
  },
  {
    "id": "1m91b6j",
    "subreddit": "wallstreetbets",
    "title": "Lithium is on the comeback with China crackdown",
    "selftext": "ALB DD: China just fucked the lithium market and nobody noticed\nTL;DR: China shut down a bunch of lithium mines and processing plants. ALB earnings are July 30.\n\n\nSo I’ve been following this lithium situation and I think something major is happening that most people are missing.\n\nChina started shutting down lithium operations this month. Not just one or two companies - we’re talking about a systematic crackdown:\n\n\t•\tJuly 17: Zangge Mining shut down (11,000 tonnes annual capacity)\n\t•\tJuly 24: 8 mines in Yichun got flagged for permit violations\n\t•\tJuly 25: 12 lithium processing plants ordered to shut down for 30 days\n\t•\tAugust 9: The big one - Jiaxiawao Mine’s permit expires. This thing produces 120,000 tonnes annually and from what I’m reading on Chinese forums, there’s maybe a 20-30% chance it gets renewed.\n\nThat last one is huge. Jiaxiawao is the biggest lithium operation in the Yichun region, which they call the “Lithium Capital of Asia.” If it doesn’t get renewed, we’re looking at losing about 15-20% of global lithium supply.\n\nHere’s the weird part: Chinese lithium futures have been hitting daily limits for two days straight. Chinese lithium stocks are up 10-15%. But ALB is only up like 6%.\n\nI spent some time on Chinese trading forums (Google Translate is your friend) and they’re going absolutely nuts about this. Thousands of posts about supply shortages and price targets. Meanwhile, if you search “lithium” on WSB or investing subreddits, people are still talking about oversupply from earlier this year.\n\nThe timing couldn’t be better for ALB earnings on July 30.\n\nQ2 results are going to suck because all this enforcement stuff started after the quarter ended. But the forward guidance call is where it gets interesting. ALB management will be the first major Western lithium company to address what’s happening in China.\n\nIf they come out and say something like “we’re seeing increased demand for non-Chinese lithium supply” or “we expect pricing to improve in the second half,” this thing could move hard.\n\nWhy ALB specifically?\n\nThey don’t have any operations in China. Everything is in Chile, Australia, and the US. So while Chinese companies are getting shut down, ALB becomes more valuable as a secure supply source.\n\nThink about it from a customer perspective. If you’re Tesla or CATL or whoever, and 20% of global lithium supply just became unreliable, you’re going to pay a premium for guaranteed supply from stable jurisdictions.\n\nALB also has processing capabilities, which is important because 65% of global lithium processing happens in China. If Chinese processors are getting shut down too, that creates another bottleneck.\n\nSome quick math:\n\nBefore this enforcement wave, the market was expecting about 90,000 tonnes of lithium oversupply in 2025. If China really takes 150,000+ tonnes offline, we flip from oversupply to a 30,000-60,000 tonne deficit.\n\nThat’s a massive change in market dynamics.\n\nRisks:\n\nObviously China could reverse course and restart everything. But this seems to be part of their broader “anti-involution” policy to reduce overcapacity across multiple industries. It’s not just lithium - they’re doing similar things with steel, solar panels, etc.\n\nThe other risk is that ALB management plays it conservative on the earnings call and doesn’t really acknowledge the opportunity. But even neutral guidance would probably be bullish given the setup.\n\nTechnical stuff:\n\nALB has been trying to break out of a multi-year downtrend. There’s resistance around $82 but if it clears that on volume, next stop is probably $95-100.\n\nShort interest is around 22% which is pretty high. If this thing starts moving on earnings, could get interesting.\n\nWhat I’m watching:\n\n\t1.\tJuly 30 earnings call - specifically any comments about Chinese supply disruptions or increased customer interest\n\t2.\tAugust 9 - whether Jiaxiawao Mine gets its permit renewed\n\t3.\tQ3 earnings season - first results that would actually show the impact of higher lithium prices\n\nI think the market is still pricing ALB based on the oversupply narrative from earlier this year. If China really is enforcing supply discipline, that thesis is dead.\n\nThe information asymmetry here is pretty crazy. Chinese markets are already pricing in a supply shock while Western markets are barely aware it’s happening.\n\nCould be wrong, but this feels like one of those situations where being early pays off big time.\n\nPositions: Long 500 shares, August $85 calls, September $90 calls. Will update after earnings.",
    "created_utc": 1753455250.0,
    "score": 40,
    "num_comments": 15,
    "author": "Requires-citation",
    "url": "https://i.redd.it/87v63xfpa1ff1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m91b6j/lithium_is_on_the_comeback_with_china_crackdown/",
    "timestamp": "2025-07-25T14:54:10Z",
    "ticker": null
  },
  {
    "id": "1m94e1u",
    "subreddit": "wallstreetbets",
    "title": "Who says gay bers can’t win",
    "selftext": "Usually I’m a bull, but this market cannot be this sustainable. There is no fucking shot a pull back doesn’t happen soon.",
    "created_utc": 1753462245.0,
    "score": 29,
    "num_comments": 18,
    "author": "Strange_Ad7482",
    "url": "https://i.redd.it/vdyvyuaiv1ff1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m94e1u/who_says_gay_bers_cant_win/",
    "timestamp": "2025-07-25T16:50:45Z",
    "ticker": null
  },
  {
    "id": "1m8n5mw",
    "subreddit": "wallstreetbets",
    "title": "Intel Earnings Report in a Nutshell",
    "selftext": "",
    "created_utc": 1753409480.0,
    "score": 334,
    "num_comments": 32,
    "author": "eudaimonia_dc",
    "url": "https://i.redd.it/5i6mpx0mixef1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m8n5mw/intel_earnings_report_in_a_nutshell/",
    "timestamp": "2025-07-25T02:11:20Z",
    "ticker": null
  },
  {
    "id": "1m90w64",
    "subreddit": "wallstreetbets",
    "title": "My humble submission. Sorry Grandma",
    "selftext": "",
    "created_utc": 1753454297.0,
    "score": 27,
    "num_comments": 12,
    "author": "capnShocker",
    "url": "https://i.redd.it/t9jaydos71ff1.png",
    "permalink": "/r/wallstreetbets/comments/1m90w64/my_humble_submission_sorry_grandma/",
    "timestamp": "2025-07-25T14:38:17Z",
    "ticker": null
  },
  {
    "id": "1m9153m",
    "subreddit": "wallstreetbets",
    "title": "RKT….To The Ground???",
    "selftext": "Guys your suppose to make the line go down…..",
    "created_utc": 1753454858.0,
    "score": 23,
    "num_comments": 16,
    "author": "FunBreakfast6867",
    "url": "https://i.redd.it/wruthklj91ff1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m9153m/rktto_the_ground/",
    "timestamp": "2025-07-25T14:47:38Z",
    "ticker": null
  },
  {
    "id": "1m8mcga",
    "subreddit": "wallstreetbets",
    "title": "I tried hopping over after losing on open. Now Im losing here 😞",
    "selftext": "",
    "created_utc": 1753407143.0,
    "score": 286,
    "num_comments": 242,
    "author": "AntiRobo46",
    "url": "https://i.redd.it/1r69ghonbxef1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m8mcga/i_tried_hopping_over_after_losing_on_open_now_im/",
    "timestamp": "2025-07-25T01:32:23Z",
    "ticker": null
  },
  {
    "id": "1m9400d",
    "subreddit": "wallstreetbets",
    "title": "Easy $17k in a day on TSLA",
    "selftext": "When TSLA flirts with $300, I buy.  Still have some shares of TSLA and TSLL in case it goes back to 350 or so.",
    "created_utc": 1753461368.0,
    "score": 19,
    "num_comments": 14,
    "author": "FunkOff",
    "url": "https://i.redd.it/vdkbqnajs1ff1.png",
    "permalink": "/r/wallstreetbets/comments/1m9400d/easy_17k_in_a_day_on_tsla/",
    "timestamp": "2025-07-25T16:36:08Z",
    "ticker": null
  },
  {
    "id": "1m8jhf4",
    "subreddit": "wallstreetbets",
    "title": "Full Port QQQ Puts for Tomorrow",
    "selftext": "https://preview.redd.it/k5ei3fjkmwef1.png?width=1617&format=png&auto=webp&s=df46bde4e1108378551a9540726b3d9334cc12b9\n\nTomorrow **WILL** be a red day. The perfect storm of:\n\n\\-Overextended rally with no drawdowns\n\n\\-Bad earnings (INTC, TSLA, DOW) are actually getting shit on, while good earnings results (GOOG, NOW) are only resulting in moderate rises\n\n\\-Every recent candle has long tails from drawdown before ending slightly up\n\n\\-Friday, perfect time for profit taking (Within this recent rally, 4 out of the 5 last Fridays have posted losses)\n\n\\-Trump making boneheaded visit to pressure my king J. Pow into submission\n\n\\-I've already bought these puts and can't reverse them before they half in value tomorrow morning\n\nHowever, I am not **THAT** regarded. I've placed my puts firmly ITM to avoid theta burn if more bullshit chop happens. Got a pretty good time too, even a flat move will turn a mild profit. Godspeed to me and to you, fellow regards.\n\nhttps://preview.redd.it/0vjmd86xnwef1.png?width=1055&format=png&auto=webp&s=e338897f143c802ab699eba13562e11419a61ef0\n\n",
    "created_utc": 1753399137.0,
    "score": 406,
    "num_comments": 269,
    "author": "ExtremelyBigYikes",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/1m8jhf4/full_port_qqq_puts_for_tomorrow/",
    "permalink": "/r/wallstreetbets/comments/1m8jhf4/full_port_qqq_puts_for_tomorrow/",
    "timestamp": "2025-07-24T23:18:57Z",
    "ticker": null
  },
  {
    "id": "1m8l6ps",
    "subreddit": "wallstreetbets",
    "title": "AMD $857K YOLO",
    "selftext": "https://preview.redd.it/qz69a51q1xef1.png?width=1388&format=png&auto=webp&s=6fa54d52eef72e0265645e740ff5ab2a97312418\n\nUp 32% so far. $250 incoming.",
    "created_utc": 1753403816.0,
    "score": 311,
    "num_comments": 107,
    "author": "brilliantzen",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/1m8l6ps/amd_857k_yolo/",
    "permalink": "/r/wallstreetbets/comments/1m8l6ps/amd_857k_yolo/",
    "timestamp": "2025-07-25T00:36:56Z",
    "ticker": null
  },
  {
    "id": "1m947zh",
    "subreddit": "wallstreetbets",
    "title": "25k yolo",
    "selftext": "Saw a Kohl’s while I was driving today. There was another store with red letters next to it. Parking lot was empty.",
    "created_utc": 1753461871.0,
    "score": 16,
    "num_comments": 17,
    "author": "bodyofchristened",
    "url": "https://www.reddit.com/gallery/1m947zh",
    "permalink": "/r/wallstreetbets/comments/1m947zh/25k_yolo/",
    "timestamp": "2025-07-25T16:44:31Z",
    "ticker": null
  },
  {
    "id": "1m8lrly",
    "subreddit": "wallstreetbets",
    "title": "$GOOGL YOLO - The Dip to $191 was a Gift from the Volatility Gods",
    "selftext": "My last post got removed. Reposting in a more civil manner. Sorry Gay Mods.\n\nI posted this before earnings: [https://www.reddit.com/r/wallstreetbets/comments/1m46fuj/googles\\_ai\\_awakening\\_earnings\\_bull\\_case/](https://www.reddit.com/r/wallstreetbets/comments/1m46fuj/googles_ai_awakening_earnings_bull_case/)\n\nI'm still in. \n\nhttps://preview.redd.it/0l34tbaf6xef1.jpg?width=1290&format=pjpg&auto=webp&s=80a7612018aa7d22ebb62da812094333ba84e276\n\n**My Thesis is Simple:**\n\nThe market is acting emotionally, and I'm acting rationally. The post-earnings price drop was a textbook case of IV crush combined with a market overreaction. While everyone was freaking out about the intraday swing, the actual long-term story only got stronger.\n\nThis dip to $191 was great, for my covered calls I sold.\n\nHere’s why I’m not sweating the daily noise:\n\n1. **The $106 Billion Backlog:** This isn't a forecast. It's a backlog of committed orders, mostly for their high-margin cloud and AI services. This is future revenue that's already on the books.\n2. **The $85 Billion CapEx:** This isn't speculative spending. They are building the infrastructure required to service that massive backlog. They are investing in the machinery to print cash for the next five years.\n3. **The AI Moat:** Gemini's integration across the entire Google ecosystem (Search, Workspace, Cloud) is a long-term catalyst that the market is still struggling to price correctly.\n\nPeople who sold today traded a long-term winning strategy for short-term fear. I believe the path to a $3 Trillion valuation ($250/share) is clear, and the market just gave us a beautiful discount.\n\nwe march on to 250!",
    "created_utc": 1753405458.0,
    "score": 251,
    "num_comments": 92,
    "author": "wanderingtofu",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/1m8lrly/googl_yolo_the_dip_to_191_was_a_gift_from_the/",
    "permalink": "/r/wallstreetbets/comments/1m8lrly/googl_yolo_the_dip_to_191_was_a_gift_from_the/",
    "timestamp": "2025-07-25T01:04:18Z",
    "ticker": null
  },
  {
    "id": "1m94ydf",
    "subreddit": "wallstreetbets",
    "title": "LQDA had a stellar drug launch",
    "selftext": "Some of you may remember [this dd from Martin Shkreli](https://www.reddit.com/r/wallstreetbets/comments/w2yt4g/lqda_long_idea/) three years ago, well LQDA finally was able to launch their drug after dealing with some additional patent trolling from their competitor UTHR and the results for their first month of sales of June came in on wednesday, see below\n\nhttps://preview.redd.it/49al2dryy1ff1.png?width=1161&format=png&auto=webp&s=2ff9ef8e2e3fd7619add6d6ea8010d42106efad9\n\nLQDA’s first month sales indicate it is on track to hit almost half of annual starts, first monthly print of 224 prescriptions annualizes at 2688. At 10k/month this means 322mil annual rev. LQDA’s main competitor serves about 50k prescriptions a year -if LQDA can claw some of these, the TAM is pretty significant. Pharma is pretty sticky so I won’t speculate there.\n\nNote : I think some of these prescriptions go to PH-ILD patients too, see below for TAM that is a newer market.\n\nhttps://preview.redd.it/0w0tvirzy1ff1.png?width=2233&format=png&auto=webp&s=267fa80da22338154f2079f19935300addea7196\n\n\n\nLQDA market cap at 1.6 billion and it’s going to be 5x p/s at the end of this year with a real shot of increasing sales much further. Something interesting about Shkreli’s first DD is he projected Tyvaso to grow to about 900 mil revenue in 2025 - Tyvaso is doing 1.8 **billion** revenue annualized right now. So this market is clearly growing a lot faster than people were projecting years ago, and there are indications that it could keep growing. I don’t want to speculate too much because I know jack shit about these diseases, I just think the chart looks like it’s about to blast through to new highs as wall st digests that this was a killer drug launch and, more importantly, traders are going to look at VRNA which had a similarly good launch and think that perhaps some sort of acquisition is possible.\n\nhttps://preview.redd.it/y2qdkia1z1ff1.png?width=2326&format=png&auto=webp&s=b40f65709db01d656e38e3fbeb0c6b66bc5b154c\n\nA lot of people are going to anchor to VRNA’s acquisition by Merck, I think that is the wrong way to look at this COPD has 8.6 million patients and a lot are untreated from what I understand. I think the VRNA comparisons are wrong for many reasons, but that won’t keep traders from making them, which is what I think is going to rapidly reprice this over the next few months before the market gets ahead of itself. The only reason I am including VRNA chart below is to show evidence that historically wall street waits until drug launch sales data starts to trickle in before catalyzing a rerate\n\n[VRNA drug launched in august 2024 and sold well](https://preview.redd.it/3ygyv9w3z1ff1.png?width=2378&format=png&auto=webp&s=339f1b75b680097c1db834bd4db08c80da3d7fcf)\n\nP.S. Shkreli’s original DD had LQDA getting to 100mil rev in it’s first year of drug launch, saturating around 27% of market share 5 years after launch. He also had projected that Tyvaso (LQDA competitor) would only be doing 900 mil of revenue in 2025, Tyvaso is on pace to do 1.8 billion. LQDA is on pace to do 300 million in revenue this yr, and if they get 27% of market that’s 480 million. Shkreli’s original price target was $20, I have no idea how high LQDA can go but this seems like a pretty good price to buy if you trust his DD.\n\nPOSITIONS just shares for now with a tiny position of calls since it's ran up so hard this week, I plan to buy calls if it dips\n\nhttps://preview.redd.it/e34gcvd5z1ff1.png?width=1170&format=png&auto=webp&s=3ec5960188356094d0c64c4d6ac532be2e362543\n\nhttps://preview.redd.it/nie8d4i6z1ff1.png?width=1170&format=png&auto=webp&s=6884f9b855ffd24694dc120f3ed8881d8e68ac48",
    "created_utc": 1753463516.0,
    "score": 12,
    "num_comments": 10,
    "author": "robbinhood69",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/1m94ydf/lqda_had_a_stellar_drug_launch/",
    "permalink": "/r/wallstreetbets/comments/1m94ydf/lqda_had_a_stellar_drug_launch/",
    "timestamp": "2025-07-25T17:11:56Z",
    "ticker": null
  },
  {
    "id": "1m90k4q",
    "subreddit": "wallstreetbets",
    "title": "$CAVA 30k YOLO -- Let's get to $90!",
    "selftext": "YOLO 30K on $CAVA...maybe my wife will divorce me after this!!!!! Can we get it to 90???>!&#x200B;!<",
    "created_utc": 1753453508.0,
    "score": 20,
    "num_comments": 24,
    "author": "No-Acanthaceae-186",
    "url": "https://i.redd.it/9sgi11ch51ff1.png",
    "permalink": "/r/wallstreetbets/comments/1m90k4q/cava_30k_yolo_lets_get_to_90/",
    "timestamp": "2025-07-25T14:25:08Z",
    "ticker": null
  },
  {
    "id": "1m8alpp",
    "subreddit": "wallstreetbets",
    "title": "That’s a wrap",
    "selftext": "All right I’m out after holding for a couple months, was aiming for 40 gain but miscalculated the set price. ",
    "created_utc": 1753377976.0,
    "score": 902,
    "num_comments": 95,
    "author": "Lopsided_Spare7214",
    "url": "https://i.redd.it/5g4kulnxwuef1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m8alpp/thats_a_wrap/",
    "timestamp": "2025-07-24T17:26:16Z",
    "ticker": null
  },
  {
    "id": "1m8puox",
    "subreddit": "wallstreetbets",
    "title": "Time to go back in",
    "selftext": "",
    "created_utc": 1753417788.0,
    "score": 116,
    "num_comments": 49,
    "author": "Lightsoutpromo",
    "url": "https://i.redd.it/jccdslfb7yef1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m8puox/time_to_go_back_in/",
    "timestamp": "2025-07-25T04:29:48Z",
    "ticker": null
  },
  {
    "id": "1m910lu",
    "subreddit": "wallstreetbets",
    "title": "$OSCR YOLO down the drain",
    "selftext": "",
    "created_utc": 1753454585.0,
    "score": 17,
    "num_comments": 15,
    "author": "theviableredditor",
    "url": "https://i.redd.it/2weux98q81ff1.png",
    "permalink": "/r/wallstreetbets/comments/1m910lu/oscr_yolo_down_the_drain/",
    "timestamp": "2025-07-25T14:43:05Z",
    "ticker": null
  },
  {
    "id": "1m9406j",
    "subreddit": "wallstreetbets",
    "title": "$5.5k gain on 0DTE SPY calls, almost 200%",
    "selftext": "Back to the daily grind after swinging for the fences and coming up short. One of these times I'm gonna hit it lol. Got out of this one right at the peak of the day so far.\n\nhttps://preview.redd.it/ath5tnyps1ff1.png?width=1733&format=png&auto=webp&s=07dd64c84152cd8979ceb4bf0429a240e12808b9\n\nNow if I can only hit a play like this when I have like $40k on it....",
    "created_utc": 1753461378.0,
    "score": 12,
    "num_comments": 9,
    "author": "Jebusfreek666",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/1m9406j/55k_gain_on_0dte_spy_calls_almost_200/",
    "permalink": "/r/wallstreetbets/comments/1m9406j/55k_gain_on_0dte_spy_calls_almost_200/",
    "timestamp": "2025-07-25T16:36:18Z",
    "ticker": null
  },
  {
    "id": "1m8nvg2",
    "subreddit": "wallstreetbets",
    "title": "Poor Intel guy",
    "selftext": "Poor grandma",
    "created_utc": 1753411616.0,
    "score": 143,
    "num_comments": 60,
    "author": "Tegridyfarms44",
    "url": "https://www.msn.com/en-in/news/other/intel-cuts-15-of-workforce-scraps-multibillion-dollar-chip-expansion-plans/ar-AA1JfDDU?ocid=BingNewsVerp",
    "permalink": "/r/wallstreetbets/comments/1m8nvg2/poor_intel_guy/",
    "timestamp": "2025-07-25T02:46:56Z",
    "ticker": null
  },
  {
    "id": "1m88ztq",
    "subreddit": "wallstreetbets",
    "title": "OPEN the piggy bank",
    "selftext": "I'm back again. Double or nothing - Today we ride. I just like the stonk",
    "created_utc": 1753374369.0,
    "score": 978,
    "num_comments": 243,
    "author": "Mah_Name_Jef",
    "url": "https://i.redd.it/nadhkak7muef1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m88ztq/open_the_piggy_bank/",
    "timestamp": "2025-07-24T16:26:09Z",
    "ticker": null
  },
  {
    "id": "1m8h4bh",
    "subreddit": "wallstreetbets",
    "title": "$RDDT 650K YOLO",
    "selftext": "Because ID",
    "created_utc": 1753393108.0,
    "score": 267,
    "num_comments": 50,
    "author": "iTouchStuff",
    "url": "https://i.redd.it/iad370jx5wef1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m8h4bh/rddt_650k_yolo/",
    "timestamp": "2025-07-24T21:38:28Z",
    "ticker": null
  },
  {
    "id": "1m8h8fl",
    "subreddit": "wallstreetbets",
    "title": "I’m a full regard now",
    "selftext": "Started with penny stocks evolved into options",
    "created_utc": 1753393386.0,
    "score": 228,
    "num_comments": 67,
    "author": "Strange_Ad7482",
    "url": "https://i.redd.it/24eb3o9r6wef1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m8h8fl/im_a_full_regard_now/",
    "timestamp": "2025-07-24T21:43:06Z",
    "ticker": null
  },
  {
    "id": "1m8ekaq",
    "subreddit": "wallstreetbets",
    "title": "What Are Your Moves Tomorrow, July 25, 2025",
    "selftext": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/wallstreetbets/comments/1m8ekaq)",
    "created_utc": 1753387052.0,
    "score": 297,
    "num_comments": 8270,
    "author": "wsbapp",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/1m8ekaq/what_are_your_moves_tomorrow_july_25_2025/",
    "permalink": "/r/wallstreetbets/comments/1m8ekaq/what_are_your_moves_tomorrow_july_25_2025/",
    "timestamp": "2025-07-24T19:57:32Z",
    "ticker": null
  },
  {
    "id": "1m8ao31",
    "subreddit": "wallstreetbets",
    "title": "Crocs-Pot of Gold: Uncovering the Infinite Money Glitch",
    "selftext": "I know what WSB is thinking, another \"infinite money glitch\" post. But hear me out because this is so absurd, so unbelievably simple, tied to the most hideous footwear on the planet that it just **MIGHT** work. And if it does, we're all retiring to a private island with **UNLIMITED** pairs of Crocs.\n\nI'm talking about **Crocs call options.**\n\nNow, before you dismiss me as a madman who's spent too much time sniffing Croslite. Crocs against all odds has been crushing it. People love them, hate them, but they **buy** them. They're comfortable, versatile (especially when you put them in 4-wheel drive), and apparently, recession-proof.\n\nHere's the \"glitch\" and how we get rich with Unlimited pairs of Crocs:\n\n**Step 1: Buy Crocs Call Options.** Start small. The idea is to buy calls with an expiration slightly after their upcoming earnings on August 7^(th). Crox has been buying back a ton of their own shares at the P/E multiple of 6 (highway robbery at these prices). Earnings are going to crush come August and Crox will rerate. Once they crush and our calls go brrrrr, we go into step 2.\n\n**Step 2: Cash Out & Buy a couple pairs of Crocs Shoes.** This is the crucial part of the \"glitch.\" Take a portion of your profits from the options and buy a couple pairs of Crocs before the next earnings cycle.\n\n**Step 3: Repeat the Cycle.** Now we have \\*free\\* physical Crocs which boosted Crocs Revenues and Profits and also have more calls. **Every pair of Crocs you buy with your options gains contributes to the ongoing demand for Crocs pushing the stock price higher for the next round of call options.**\n\nIt's a prophecy of rubbery goodness! We continue the cycle until we have a lifetime supply of Crocs and a lifetime supply of gains.\n\nTLDR; Buy CROX calls with an expiration date after earnings, use your gains to buy more calls and Croc shoes for the next earnings. Repeat until retired on the beach wearing Crocs. (also I'm poor so only have 10 calls to start)\n\nhttps://preview.redd.it/hqdarh0rwuef1.png?width=624&format=png&auto=webp&s=805d987878971b28a420ed9286af7f02f297ad63\n\n",
    "created_utc": 1753378121.0,
    "score": 463,
    "num_comments": 172,
    "author": "MarketMaker9",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/1m8ao31/crocspot_of_gold_uncovering_the_infinite_money/",
    "permalink": "/r/wallstreetbets/comments/1m8ao31/crocspot_of_gold_uncovering_the_infinite_money/",
    "timestamp": "2025-07-24T17:28:41Z",
    "ticker": null
  },
  {
    "id": "1m910ye",
    "subreddit": "wallstreetbets",
    "title": "Decker? Hardly know her…",
    "selftext": "",
    "created_utc": 1753454609.0,
    "score": 8,
    "num_comments": 5,
    "author": "cynight527",
    "url": "https://i.redd.it/ntjeh8ws81ff1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m910ye/decker_hardly_know_her/",
    "timestamp": "2025-07-25T14:43:29Z",
    "ticker": null
  },
  {
    "id": "1m8bfh6",
    "subreddit": "wallstreetbets",
    "title": "Tomorrow marks my 1 year anniversary of the 100k milestone... some good returns since then",
    "selftext": "Mainly just buying and holding ASTS since 2021, that's what you see in the main account.\n\n  \nSecond account with the options is the backdoor roth.  Started it last year, about 9k deposited total so over 100% returns so far, and my positions in it.  I try to just buy shares and sell calls on whatever shares I have, usually RDDT or RKLB but now I'm intrigued by GLXY.\n\n  \nThird acct is my HSA - Trying to be a lot safer (sorry, wsb) so I'm just waiting for a market dip to buy VT or QQQ or some shit and go 75/25 QQQ/BTC, etc.\n\n  \nP.S. if you're wondering why it doesn't all add up to the total, I also do my checking with Fidelity and have a CMA so I can keep my paycheck money in SPAXX and get 4% or whatever... but that's \"uninvested\" so I didn't screenshot that ",
    "created_utc": 1753379830.0,
    "score": 355,
    "num_comments": 54,
    "author": "WillNeighbor",
    "url": "https://www.reddit.com/gallery/1m8bfh6",
    "permalink": "/r/wallstreetbets/comments/1m8bfh6/tomorrow_marks_my_1_year_anniversary_of_the_100k/",
    "timestamp": "2025-07-24T17:57:10Z",
    "ticker": null
  },
  {
    "id": "1m8zhu0",
    "subreddit": "wallstreetbets",
    "title": "Deck calls gain and pls don't don't fomo or yolo like me",
    "selftext": "Lol, iv was like 110% when i bought it.",
    "created_utc": 1753450906.0,
    "score": 10,
    "num_comments": 13,
    "author": "Delicious-Topic-69",
    "url": "https://i.redd.it/e0oycsisx0ff1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m8zhu0/deck_calls_gain_and_pls_dont_dont_fomo_or_yolo/",
    "timestamp": "2025-07-25T13:41:46Z",
    "ticker": null
  },
  {
    "id": "1m87hbk",
    "subreddit": "wallstreetbets",
    "title": "$13245 -> $100,000 ASTS",
    "selftext": "",
    "created_utc": 1753370958.0,
    "score": 546,
    "num_comments": 83,
    "author": "HazHonorAndAPenis",
    "url": "https://i.redd.it/j20fktgobuef1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m87hbk/13245_100000_asts/",
    "timestamp": "2025-07-24T15:29:18Z",
    "ticker": null
  },
  {
    "id": "1m8j5ab",
    "subreddit": "wallstreetbets",
    "title": "First Ever Option Trade GOOGL $175 Call 9/19 wish me luck!",
    "selftext": "If I’m successful on my first trade I will be eager to lose it all with false confidence on future trades. 👍\n",
    "created_utc": 1753398267.0,
    "score": 109,
    "num_comments": 23,
    "author": "LpeteXstream",
    "url": "https://i.redd.it/pjd2ilj9lwef1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m8j5ab/first_ever_option_trade_googl_175_call_919_wish/",
    "timestamp": "2025-07-24T23:04:27Z",
    "ticker": null
  },
  {
    "id": "1m91ruw",
    "subreddit": "wallstreetbets",
    "title": "META weeklies printing!",
    "selftext": "",
    "created_utc": 1753456305.0,
    "score": 6,
    "num_comments": 2,
    "author": "ninjikita",
    "url": "https://i.redd.it/tsx2r7ptd1ff1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m91ruw/meta_weeklies_printing/",
    "timestamp": "2025-07-25T15:11:45Z",
    "ticker": null
  },
  {
    "id": "1m86son",
    "subreddit": "wallstreetbets",
    "title": "$AEO Who doesn’t like Sydney Sweeney. That’s my DD.",
    "selftext": "",
    "created_utc": 1753369406.0,
    "score": 281,
    "num_comments": 70,
    "author": "YoLoApehands",
    "url": "https://i.redd.it/53lkobag7uef1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m86son/aeo_who_doesnt_like_sydney_sweeney_thats_my_dd/",
    "timestamp": "2025-07-24T15:03:26Z",
    "ticker": null
  },
  {
    "id": "1m8pdn7",
    "subreddit": "wallstreetbets",
    "title": "-$6k Loss (Day 3 full ported in PGY Calls)",
    "selftext": "Read my DD: https://www.reddit.com/r/wallstreetbets/s/rSMVUjXycD",
    "created_utc": 1753416252.0,
    "score": 27,
    "num_comments": 11,
    "author": "quantum_system",
    "url": "https://i.redd.it/uqa03lyq2yef1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m8pdn7/6k_loss_day_3_full_ported_in_pgy_calls/",
    "timestamp": "2025-07-25T04:04:12Z",
    "ticker": null
  },
  {
    "id": "1m8evuo",
    "subreddit": "wallstreetbets",
    "title": "Intel $INTC Earnings",
    "selftext": "Intel $INTC Earnings:\n– Adjusted EPS: -$0.10 (vs. est. $0.01)\n– Revenue: $12.86B (vs. est. $11.92B)\n– Announces 15% workforce reduction",
    "created_utc": 1753387787.0,
    "score": 104,
    "num_comments": 72,
    "author": "eskhalaf",
    "url": "https://www.businesswire.com/news/home/20250724988641/en/Intel-Reports-Second-Quarter-2025-Financial-Results",
    "permalink": "/r/wallstreetbets/comments/1m8evuo/intel_intc_earnings/",
    "timestamp": "2025-07-24T20:09:47Z",
    "ticker": null
  },
  {
    "id": "1m8mjwx",
    "subreddit": "wallstreetbets",
    "title": "YOLO’d on $PZZA Calls — Betting on a Tasty Buyout in the 60s",
    "selftext": "\n🍕 YOLO’d $45K on $PZZA $57.50 Calls — Betting on a Buyout in the 60s 🚀\n\nAlright degenerates — I just dropped $45K in premium on Papa John’s $57.50 calls because the oven’s heating up and this pizza might be getting taken private.\n\nReuters dropped a spicy leak: Apollo Global and Irth Capital (yes, the Qatari-backed fund that already owns ~5% of $PZZA) have submitted a take-private bid valuing the company in the low $60s.\n\nStock popped to ~$54 on the initial rumor — since then, it’s cooled back to the upper $40s. Perfect entry point.\n\n⸻\n\n🧩 The Setup\n\t•\tIrth Capital already owns 5% — they’re not window-shopping.\n\t•\tApollo has serious fast-food buyout pedigree: Qdoba, Chuck E. Cheese, Wagamama. This is their lane.\n\t•\tReported valuation: ~$1.7B–$2B, implying low $60s per share. That’s a ~30% premium to where the stock sits today.\n\t•\tStreet analysts say the math checks out — around 14.5x EBITDA, not some meme multiple.\n\n⸻\n\n💸 My Play\n\nLoaded the boat on $57.50 strike calls, aiming squarely at a buyout in the 60s.\n\nBreakeven is under the rumored takeout price — if this thing hits, those calls are going deep into the crust.\n\nIf the deal’s real? I’m printing.\nIf we get a bidding war? I’m retiring.\nIf it flames out? I’m eating frozen DiGiorno and bagholding a dream.\n\n⸻\n\n📡 What I’m Watching\n\t•\tSEC filings — any 13D/13G/A from Irth or Apollo = game on\n\t•\tFollow-up reporting or leaks from Semafor, Reuters, etc.\n\t•\tPZZA holding >$54 on volume = possible gamma lift\n\t•\tOther bidders sniffing around — Roark, Inspire, etc. could add fuel\n\n⸻\n\nThis is either a surgical options trade on a credible take-private… or a $45K grease fire.\n\nBut Papa didn’t step down for me to play it safe.\n\n$PZZA to the 60s — no stop loss, extra garlic butter.\n\n⸻\n",
    "created_utc": 1753407734.0,
    "score": 34,
    "num_comments": 23,
    "author": "awesomeeight",
    "url": "https://i.redd.it/6s3rn76fdxef1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m8mjwx/yolod_on_pzza_calls_betting_on_a_tasty_buyout_in/",
    "timestamp": "2025-07-25T01:42:14Z",
    "ticker": null
  },
  {
    "id": "1m8nhqw",
    "subreddit": "wallstreetbets",
    "title": "Used margin to yolo on SPY puts exp Monday . I should’ve taken profits",
    "selftext": "",
    "created_utc": 1753410496.0,
    "score": 36,
    "num_comments": 32,
    "author": "Low_Dish9781",
    "url": "https://i.redd.it/1v7ciytmlxef1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m8nhqw/used_margin_to_yolo_on_spy_puts_exp_monday_i/",
    "timestamp": "2025-07-25T02:28:16Z",
    "ticker": null
  },
  {
    "id": "1m88cc4",
    "subreddit": "wallstreetbets",
    "title": "This is what you call, \"Blowing up your account\". Don't be like me. Please wish me luck though. Thank you for your attention to this matter.",
    "selftext": "",
    "created_utc": 1753372899.0,
    "score": 205,
    "num_comments": 102,
    "author": "GrossFleshSack",
    "url": "https://i.redd.it/15gd4rwthuef1.png",
    "permalink": "/r/wallstreetbets/comments/1m88cc4/this_is_what_you_call_blowing_up_your_account/",
    "timestamp": "2025-07-24T16:01:39Z",
    "ticker": null
  },
  {
    "id": "1m8bryw",
    "subreddit": "wallstreetbets",
    "title": "Yo dawg, I see your on $RDDT, so i'm posting $RDDT on your $RDDT",
    "selftext": "",
    "created_utc": 1753380613.0,
    "score": 89,
    "num_comments": 28,
    "author": "areyouready101",
    "url": "https://i.redd.it/fo88qfxr4vef1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m8bryw/yo_dawg_i_see_your_on_rddt_so_im_posting_rddt_on/",
    "timestamp": "2025-07-24T18:10:13Z",
    "ticker": null
  },
  {
    "id": "1m914fc",
    "subreddit": "wallstreetbets",
    "title": "I'm a betting man and I've won the chance to ask a goddess out for the weekend.",
    "selftext": "",
    "created_utc": 1753454818.0,
    "score": 3,
    "num_comments": 3,
    "author": "Crashboom04",
    "url": "https://i.redd.it/pk5x5qq791ff1.jpeg",
    "permalink": "/r/wallstreetbets/comments/1m914fc/im_a_betting_man_and_ive_won_the_chance_to_ask_a/",
    "timestamp": "2025-07-25T14:46:58Z",
    "ticker": null
  },
  {
    "id": "1m8wple",
    "subreddit": "GME",
    "title": "r/GME Megathread for Friday July 25th",
    "selftext": "Good Morning Everyone! We got a good discount on GME shares this morning, if you wanted to lower your average cost now is a great time to do it. GameStop has a ridiculous deal going right now for Candy Con controller faceplates 3 for $20 if you’ve wanted to purchase one now is the time!\n\nhttps://www.gamestop.com/search/?pmid=30456",
    "created_utc": 1753443137.0,
    "score": 28,
    "num_comments": 11,
    "author": "G_Wash1776",
    "url": "https://www.reddit.com/r/GME/comments/1m8wple/rgme_megathread_for_friday_july_25th/",
    "permalink": "/r/GME/comments/1m8wple/rgme_megathread_for_friday_july_25th/",
    "timestamp": "2025-07-25T11:32:17Z",
    "ticker": null
  },
  {
    "id": "1m0q0oa",
    "subreddit": "GME",
    "title": "Ryan Cohen Fox Business Interview 7/15/2025",
    "selftext": "",
    "created_utc": 1752604951.0,
    "score": 595,
    "num_comments": 57,
    "author": "G_Wash1776",
    "url": "https://youtu.be/uXyQLovyyhM?si=R3EK0dYuOxC5KQH2",
    "permalink": "/r/GME/comments/1m0q0oa/ryan_cohen_fox_business_interview_7152025/",
    "timestamp": "2025-07-15T18:42:31Z",
    "ticker": null
  },
  {
    "id": "1m90dkd",
    "subreddit": "GME",
    "title": "Shorts are Fukt",
    "selftext": "",
    "created_utc": 1753453074.0,
    "score": 262,
    "num_comments": 22,
    "author": "3Dprintmasters",
    "url": "https://v.redd.it/e006cll841ff1",
    "permalink": "/r/GME/comments/1m90dkd/shorts_are_fukt/",
    "timestamp": "2025-07-25T14:17:54Z",
    "ticker": null
  },
  {
    "id": "1m93dvk",
    "subreddit": "GME",
    "title": "\"Hester Peirce, who's one of the [SEC] Commissioners, she used to be my council when I was a [SEC] Commissioner back in 2002-2008.\" ~ SEC Chairman Paul Atkins [Bloomberg Jul 18, 2025]",
    "selftext": "",
    "created_utc": 1753459963.0,
    "score": 64,
    "num_comments": 9,
    "author": "ringingbells",
    "url": "https://v.redd.it/hgylaq7lo1ff1",
    "permalink": "/r/GME/comments/1m93dvk/hester_peirce_whos_one_of_the_sec_commissioners/",
    "timestamp": "2025-07-25T16:12:43Z",
    "ticker": null
  },
  {
    "id": "1m9247j",
    "subreddit": "GME",
    "title": "Bots are out today (4hr bolinger)",
    "selftext": "I've made 2 really boring, simple posts about the 4hr bolinger band today. And almost immediately, 70% of the comments are fud. Many are just straight up harassment and personal attacks? Just a lot of derision, some by \"top commenters\", which I assume just means they are bots. \n\nWhy else would you spread derision during a time where stock squeezes are happening left and right? \n\nPositions: the worst calls you can think of for gme expiring (25 gme 7/25, 30gme 8/1)",
    "created_utc": 1753457091.0,
    "score": 39,
    "num_comments": 37,
    "author": "did_it_for_the_clout",
    "url": "https://www.reddit.com/r/GME/comments/1m9247j/bots_are_out_today_4hr_bolinger/",
    "permalink": "/r/GME/comments/1m9247j/bots_are_out_today_4hr_bolinger/",
    "timestamp": "2025-07-25T15:24:51Z",
    "ticker": null
  },
  {
    "id": "1m94adb",
    "subreddit": "GME",
    "title": "Every Preferred Stock Issuance by MSTR Makes GME a Much More Attractive Option",
    "selftext": "",
    "created_utc": 1753462019.0,
    "score": 26,
    "num_comments": 5,
    "author": "Toankst",
    "url": "https://www.strategy.com/press/strategy-announces-pricing-of-strc-perpetual-preferred-stock_07-25-2025",
    "permalink": "/r/GME/comments/1m94adb/every_preferred_stock_issuance_by_mstr_makes_gme/",
    "timestamp": "2025-07-25T16:46:59Z",
    "ticker": null
  },
  {
    "id": "1m8tloo",
    "subreddit": "GME",
    "title": "493 of the last 782 trading days with short volume above 50%.Yesterday 54.87%⭕️30 day avg 50.92%⭕️SI 65.44M⭕️",
    "selftext": "",
    "created_utc": 1753431520.0,
    "score": 92,
    "num_comments": 3,
    "author": "Affectionate_Use_606",
    "url": "https://www.reddit.com/gallery/1m8tloo",
    "permalink": "/r/GME/comments/1m8tloo/493_of_the_last_782_trading_days_with_short/",
    "timestamp": "2025-07-25T08:18:40Z",
    "ticker": null
  },
  {
    "id": "1m8rixl",
    "subreddit": "GME",
    "title": "4hr Bollinger band",
    "selftext": "Following up a post I made earlier today, we have hit the 4hr bolinger band. Should see a steady climb, maybe a run up to 27. \n\nThere was immediately a lot of hate and personal attacks on the last post. So we must be close 🥸\n\n\nNfa\nPositions \n25/25.5 gme calls 7/24\n30 gme call 8/1",
    "created_utc": 1753423530.0,
    "score": 149,
    "num_comments": 29,
    "author": "did_it_for_the_clout",
    "url": "https://i.redd.it/swskgf1eoyef1.png",
    "permalink": "/r/GME/comments/1m8rixl/4hr_bollinger_band/",
    "timestamp": "2025-07-25T06:05:30Z",
    "ticker": null
  },
  {
    "id": "1m91pzw",
    "subreddit": "GME",
    "title": "DFV 2nd timeline is incomplete",
    "selftext": "Hello fellow apes,\n\nI’ve been revisiting DFV’s posts lately, and something keeps nagging at my perfectionist brain: the missing final update to the 2024 YOLO Update.\n\nBack in 2021, the first timeline had a proper arc — it ended with a final post, giving us closure. But in 2024? Nothing. No final update, despite strong hints that DFV may have sold GME for Dog Stock. Given how little he posts, I’d expect his timeline to be clean and complete — like a finished masterpiece.\n\nSo… why didn’t he wrap it up with a final GME post?\nCould it mean that his MOASS-terpiece is still unfolding? ",
    "created_utc": 1753456188.0,
    "score": 12,
    "num_comments": 15,
    "author": "gertiks",
    "url": "https://www.reddit.com/r/GME/comments/1m91pzw/dfv_2nd_timeline_is_incomplete/",
    "permalink": "/r/GME/comments/1m91pzw/dfv_2nd_timeline_is_incomplete/",
    "timestamp": "2025-07-25T15:09:48Z",
    "ticker": null
  },
  {
    "id": "1m8lq7l",
    "subreddit": "GME",
    "title": "I like fractals, emojis & good music.",
    "selftext": "[August 18, 2020 - January 11, 2021 \\* Original 100 Daily Bar \\\\\"Sneeze\\\\\"](https://preview.redd.it/3240gq3z3xef1.png?width=1920&format=png&auto=webp&s=c33cbdda73b4bb5a563e81466fedae75584c4368)\n\n[March 18, 2024 - October 21, 2025 \\* Current 400 Daily Bar \\\\\"Sneeze\\\\\"](https://preview.redd.it/dfgjamrz3xef1.png?width=1920&format=png&auto=webp&s=c9fad5b5fdc82387a9cf0d1fa31e870c7bc87c03)\n\n' You must have \"gme\", \"gamestop\" or \"ryan cohen\" somewhere in your post body. '\n\nHello GME reddit 👋\n\nJust leaving this observation here for you 👀\n\nWe are currently at a 4x vibration of our original 100 daily bar cycle that started August 18th, 2020 & ended January 11th, 2021. After that 100 bar cycle we saw the top 9 daily bars later ⏪\n\nThis time the flip happened March 18th, 2024 & will end October 21st, 2025 creating a 400 bar cycle ♻️\n\nAbove you can see both fractals, I added emojis for the areas I found to be oddly similar. 🤔\n\n[https://youtu.be/-WfsLHPHCkc?si=ZdzVaMxB67NuLVO7](https://youtu.be/-WfsLHPHCkc?si=ZdzVaMxB67NuLVO7)\n\nxoxo 🥵",
    "created_utc": 1753405344.0,
    "score": 69,
    "num_comments": 12,
    "author": "BobSaltGG",
    "url": "https://www.reddit.com/r/GME/comments/1m8lq7l/i_like_fractals_emojis_good_music/",
    "permalink": "/r/GME/comments/1m8lq7l/i_like_fractals_emojis_good_music/",
    "timestamp": "2025-07-25T01:02:24Z",
    "ticker": null
  },
  {
    "id": "1m933of",
    "subreddit": "GME",
    "title": "Haters wearing short shirts",
    "selftext": "This sub has been overrun by trolls. Either their lives are more pathetic than I thought humanly possible or……. They stand to profit from a short position in GME. It’s clearly one or the other. Put your tissues and lotion away and tell us which are you?  Talking to 🫵",
    "created_utc": 1753459320.0,
    "score": 2,
    "num_comments": 19,
    "author": "Lord_of_MindMed",
    "url": "https://www.reddit.com/r/GME/comments/1m933of/haters_wearing_short_shirts/",
    "permalink": "/r/GME/comments/1m933of/haters_wearing_short_shirts/",
    "timestamp": "2025-07-25T16:02:00Z",
    "ticker": null
  },
  {
    "id": "1m8n5oj",
    "subreddit": "GME",
    "title": "[S4:E95] The Golden Pinecone Daily Tournament (July 25st 2025)",
    "selftext": "https://preview.redd.it/9qn6gg7dhxef1.png?width=512&format=png&auto=webp&s=d1ca645e496be03227f35cfbf2b338b5093fe3ec\n\nThe Rules are simple: =================================================\n\n\\-To Win: Guess the closest to the closing daily price for GME. (the final settled price, not including After-hours trading) Guess must be in by 10:30am EST (NYT). (One hour after the opening bell)\n\n\\-An exact guess AKA the Bullseye Crew you get 2 cones for the season total standings. The count for the Bullseye Crew is just the exact number of Bullseyes this season per player.\n\n* In the result of a tie, both win a cone as both were correct.\n\n\\-No Edits: your guess is your guess, and once it is in, it cannot be changed. Early bird gets the guess. (if you edit your guess, you are disqualified for that day, sorry). If you notice your guess has already been taken, do not edit your guess but comment underneath it. At that point you can make a new guess but it still has to be in by 10:30 EST (One hour after the opening bell)\n\n\\-B2B Sniping Rule: Last guess of the day cannot win on back to back days. All guesses must be in USD amounts.\n\n\\-The seasonal standings are below the closing score and yesterday's winner. The winners circle is the hall of fame of past season winners. This is for the player with the most total wins per season. There are 250 games per season we play every day the market is trading.\n\n============================================\n\n\\*WINNERS CIRCLE\n\nSeason 1 Winner: Lorien6 ( 31 Wins )\n\nSeason 2 Winner: Bloodshot\\_Blinkers ( 34 Wins )\n\nSeason 3 Winner: isthatfair1234 ( 22 wins )\n\n**CLOSING PRICE**: $23.53\n\n**Winning Guesses:** $23.51 Stevefstorms\n\n**Notes:** 5th cone for Steve, moves into a tie for 7th. With yesterday's addition of a first time winner there have been 28 different winners this year. \n\n==== Season 4 Cone Winners ====\n\nisthatfair1234 (17)\n\ncyberpunkjay3243 (12)\n\nTallfeel (9)\n\nHeynow 846 (7)\n\nMusesoutloud (7)\n\navspuk (6)\n\nG\\_Wash1776 (5)\n\nStevefstorms (5)\n\nExpensive-Two-8128 (4)\n\nstockmarketscam-617 (4)\n\nGlobetrotting22 (4)\n\nNeilsberry427 (3)\n\ntendie\\_mcnuggets (3)\n\nWalrusSoliloquy (2)\n\nPrestigious\\_Ebb3167 (1)\n\neciptic10 (1)\n\ncosmotropik (1)\n\nLongjumping\\_Wash9556 (1)\n\nPhat\\_Kitty\\_ (1)\n\nDustey-CSK1 (1)\n\nLeftnutbrown (1)\n\nDynastyFSU2 (1)\n\nsyoung907 (1)\n\nMikeman1971 (1)\n\nBiggJermm (1)\n\nTLDCrafty (1)\n\n6\\_Pat (1)\n\nroswelljack (1)\n\n=== Bullseye Crew S4 ===\n\ncyberpunkjay3243 (2)\n\nisthatfair1234 (1)\n\nGlobetrotting22 (1)\n\nHeyNow846 (1)\n\ntallfeel (1)\n\navspuk (1)\n\nExpensive-Two-8128 (1)",
    "created_utc": 1753409484.0,
    "score": 34,
    "num_comments": 26,
    "author": "stevefstorms",
    "url": "https://www.reddit.com/r/GME/comments/1m8n5oj/s4e95_the_golden_pinecone_daily_tournament_july/",
    "permalink": "/r/GME/comments/1m8n5oj/s4e95_the_golden_pinecone_daily_tournament_july/",
    "timestamp": "2025-07-25T02:11:24Z",
    "ticker": null
  },
  {
    "id": "1m8f9ej",
    "subreddit": "GME",
    "title": "Short interest No Comprendo ...",
    "selftext": "Why do professionals short GME? \n\nCash = $9.1 billion\n\nBitcoin => $500 million \n\n$9.6 billion liquid assets, profitable, low debt, new mgmt. \n\n$9.6 billion / 447 million shares = $21.48/share (this is a reasonable floor bottom). \n\nIt is highly unlikely that the shares will go below FLOOR price that is supported by cash/bitcoin. Why do they hold a short position at 23.50 where there is maybe a $2 downside max WHILE facing much larger upside potential? \n\nThe risk/reward ... I don't get the short thesis ???",
    "created_utc": 1753388656.0,
    "score": 94,
    "num_comments": 46,
    "author": "nanonerd100",
    "url": "https://www.reddit.com/r/GME/comments/1m8f9ej/short_interest_no_comprendo/",
    "permalink": "/r/GME/comments/1m8f9ej/short_interest_no_comprendo/",
    "timestamp": "2025-07-24T20:24:16Z",
    "ticker": null
  },
  {
    "id": "1m8l876",
    "subreddit": "GME",
    "title": "Fidelity Shinanigans DRS",
    "selftext": "Did I hit a naughty list mile stone or something? I normally buy my GME shares, collect a few buys, and do the normal DRS transfer. Its been automated for a long time, I would just type DRS and follow the prompts.  Easy as talking smack about shorts. However, the last one I did a few months didn't show up in my Computershare account. Checked my Fidelity account and the share are still there and the automation has changed to DRS transfer into Fidelity? Da Ape is going on? The chat minions told me these transactions require trade specialists now? Did I miss something? Anyone else run into this?",
    "created_utc": 1753403933.0,
    "score": 41,
    "num_comments": 9,
    "author": "Red3Delta",
    "url": "https://www.reddit.com/r/GME/comments/1m8l876/fidelity_shinanigans_drs/",
    "permalink": "/r/GME/comments/1m8l876/fidelity_shinanigans_drs/",
    "timestamp": "2025-07-25T00:38:53Z",
    "ticker": null
  },
  {
    "id": "1m8723d",
    "subreddit": "GME",
    "title": "We are obviously at the wyckoff accumulation end of the wedge pattern.  Last chance to accumulate with the price manipulators, imo.  Next is squeeze and blame us like every other MEME the last few weeks, imo.",
    "selftext": "",
    "created_utc": 1753369998.0,
    "score": 238,
    "num_comments": 55,
    "author": "go_far_go_together",
    "url": "https://www.reddit.com/gallery/1m8723d",
    "permalink": "/r/GME/comments/1m8723d/we_are_obviously_at_the_wyckoff_accumulation_end/",
    "timestamp": "2025-07-24T15:13:18Z",
    "ticker": null
  },
  {
    "id": "1m89a2z",
    "subreddit": "GME",
    "title": "Uppies",
    "selftext": "Gme has been dancing around the 4hr bolinger bands. Looks like once it touches the lower bolinger, it will begin its climb. \n\nMoass tomorrow \n\nPositions: 25 calls expiring tomorrow and following Friday, 4 contracts Total \n\n",
    "created_utc": 1753375011.0,
    "score": 153,
    "num_comments": 14,
    "author": "did_it_for_the_clout",
    "url": "https://i.redd.it/b9b2g2b4ouef1.png",
    "permalink": "/r/GME/comments/1m89a2z/uppies/",
    "timestamp": "2025-07-24T16:36:51Z",
    "ticker": null
  },
  {
    "id": "1m8p2ja",
    "subreddit": "GME",
    "title": "Should gme start tokenizing assets like collectibles on the Blockchain and offer it to investors or invests in projects that does so?",
    "selftext": "Should gme start tokenizing assets like collectibles on the Blockchain and offer it to investors?\n\nGame stop is already in the crypto market with BTC. What's your opinion if gamestop either starts tokenising assets .....or invests in projects (e.g. ripple net/xrpl) that are able to tokenise assets?",
    "created_utc": 1753415291.0,
    "score": 19,
    "num_comments": 19,
    "author": "Fun_Kangaroo512",
    "url": "https://www.reddit.com/r/GME/comments/1m8p2ja/should_gme_start_tokenizing_assets_like/",
    "permalink": "/r/GME/comments/1m8p2ja/should_gme_start_tokenizing_assets_like/",
    "timestamp": "2025-07-25T03:48:11Z",
    "ticker": null
  },
  {
    "id": "1m89n15",
    "subreddit": "GME",
    "title": "Current price is close to the earning anchored VWAP",
    "selftext": "The GME Volume Weighted Average Price anchored to Earnings is currently $23.41. the current price is $23.59. This is within 0.77%.\n\nVWAP is basically a horizontal line, which means the price hasn't changed since earnings.",
    "created_utc": 1753375832.0,
    "score": 145,
    "num_comments": 11,
    "author": "Previous_Cod_1356",
    "url": "https://i.redd.it/qrd3bt4kquef1.png",
    "permalink": "/r/GME/comments/1m89n15/current_price_is_close_to_the_earning_anchored/",
    "timestamp": "2025-07-24T16:50:32Z",
    "ticker": null
  },
  {
    "id": "1m88gjt",
    "subreddit": "GME",
    "title": "To me, this looks like a perfect inverse as of this morning.",
    "selftext": "",
    "created_utc": 1753373157.0,
    "score": 119,
    "num_comments": 5,
    "author": "go_far_go_together",
    "url": "https://i.redd.it/w78pzbzkiuef1.jpeg",
    "permalink": "/r/GME/comments/1m88gjt/to_me_this_looks_like_a_perfect_inverse_as_of/",
    "timestamp": "2025-07-24T16:05:57Z",
    "ticker": null
  },
  {
    "id": "1m7ybc2",
    "subreddit": "GME",
    "title": "🔥 The Fuse Is Lit: GME’s Synthetic Derivatives, Margin Escalation-Analysis based on historical data, current market conditions, and available information on futures/swap/derivatives 🔥",
    "selftext": "This analysis only assumes GME is shorted at publicly reported levels. What we know is true will lead rocket fuel to the fire. Link to charts\n\nGameStop (GME) Margin Risk Modeling and Predictive Analysis\n\r\n“Power to the Players. We may have been early, but we weren’t wrong!”\r\n– GME Apes\n\r\nThis report presents a high-resolution analysis of the relationship between GameStop (GME) stock volatility and systemic Initial Margin (IM) multiplier changes across futures, interest rate swaps (IRS), and credit default swaps (CDS). With retail-driven volatility returning and short interest remaining elevated, a major GME price event could trigger margin expansion and liquidity crunches for overleveraged market participants.\n\n\r\nSection 1- Futures IM Multiplier vs. GME Price\n\r\nThe chart below illustrates the escalation of initial margin requirements for futures contracts under mild, moderate, and severe short squeeze scenarios triggered by specific GME price thresholds.\n(Image 1)\r\n \r\n\n\nSection 2- Staggered Margin Escalation Modeling\n\r\nThe chart below models the initial margin (IM) multiplier escalation for futures, interest rate swaps (IRS), and credit default swaps (CDS) using staggered logistic sensitivity curves. These better reflect how each instrument class reacts differently to volatility in GME price:\r\n• Futures: Fast-reacting to early volatility.\r\n• IRS: Moderate-reacting with a smoother transition.\r\n• CDS: Delayed but more severe under credit stress.\n\nThis modeling improves clarity by showing instrument-specific risk sensitivity rather than overlapping step functions.\r\n (Image 2)\n\r\n\nSection 3-Strategic Implications of Margin Escalation in GME Volatility Events\n\r\nInstitutional exposure to equity volatility is not isolated to direct equity holdings—it ripples through the financial system via margin-linked instruments like futures, swaps, and CDS. The initial margin (IM) multipliers modeled here are not arbitrary—they’re regulatory thermometers that react to the heat of price instability and dealer leverage.\r\n\r\nIn the context of GameStop (GME), a highly shorted equity with renewed momentum and activist interest, the implications are profound. As GME’s price rises sharply—particularly in clustered momentum rallies typical of short squeeze conditions—clearinghouses recalibrate risk models to demand higher margin from dealers. This is not just protective behavior—it is mechanical de-leveraging that triggers forced position reductions across the ecosystem. Firms caught flat-footed during a margin expansion are required to post collateral or close out exposures in hours, not days.\n\r\nWhat begins as a retail-led rally in a single equity cascades through to the synthetic world of leverage and derivatives. A 40–60% spike in GME price could translate to margin multipliers as high as 1.40x on futures, 1.25x on IRS, and 1.25x on CDS—magnifying systemic stress. This is not a theory; it is modeled policy by the CFTC, OCC, and ICE Clear. Our smoothed modeling shows precisely how those thresholds emerge across pricing strata, with futures reacting first, swaps mid-range, and CDS late but severely.\r\n\r\nFor activist investors, this means the battlefront isn't just in the share price—it’s in the pipes of the financial system. Strategic upward pressure on GME’s price in specific zones (e.g., $35–$60) can mechanically trigger de-risking among shorts due to independent clearinghouse logic, not sentiment or fundamentals. This is what ‘The Big Squeeze’ looks like when translated into margin mechanics.\n\r\n\n\nSection 4- Volatility-Price Stress Heatmap Interpretation\n\r\nTo better understand when systemic margin triggers may occur, the following heatmap models Initial Margin (IM) multiplier escalation across a range of GameStop (GME) price levels and implied volatility (IV) percentages. The left axis now uses percentage-based IV levels, ranging from 30% (calm markets) to 250% (extreme dislocation), offering clearer interpretation for retail and institutional readers alike.\r\n\r\nImplied Volatility (IV) is a forward-looking measure derived from the options market, representing how much the market expects the price of a security to move. When IV reaches high levels—such as 150% or 200%—it often reflects frenzied options buying (e.g., short-dated calls), dealer gamma exposure, and institutional hedging activity. \n\nGME’s previous short squeezes have demonstrated IV surges well beyond 100%, coinciding with liquidity events and forced liquidations.\r\nIn this model, we define a synthetic 'stress index' as the product of normalized price and volatility:\n\r\n    Stress = (GME Price / 40) × (IV / 50%)\r\nThis stress score approximates how central clearing counterparties (CCPs), such as the OCC or ICE Clear, respond to rising risk levels. Once stress exceeds thresholds of ~1.2 and 2.0, IM multipliers are assumed to jump from 1.05 → 1.25 and then 1.4 respectively. These are consistent with CFTC-published multiplier band ranges for market dislocation events.\n(Image 3)\r\n\r\n \r\nSection 5- Historical Benchmarking of GME Margin Conditions\n\r\nTo contextualize the 2025 margin environment, we examined prior GME price dislocations and corresponding clearinghouse responses. Each event brought unique challenges to the financial infrastructure, ranging from intraday volatility spikes to full trading halts. This benchmarking exercise highlights how implied volatility (IV) and price velocity often correlate with clearing escalations, including Initial Margin (IM) multiplier hikes, collateral surcharges, and central clearing risk memos.\n\r\nBelow is a summary of key events from 2021 through mid-2025, noting the magnitude of price spikes, peak implied volatility, and the institutional response\n\r\n(Image 4)\r\n\r\nThe January 2021 event remains the gold standard for systemic exposure, where margin calls triggered liquidity shutdowns. What followed was a progressive evolution of margin management. By April 2024, the NSCC began deploying more surgical clearing mechanisms, including ETF-weighted clearing sweeps. \n\nWhile June 2025’s conditions remain early-stage, IV of ~390% and ~85% price surge mirror March 2021. These suggest we may be entering the margin pressure zone once again. If historical patterns hold, next steps could include increased VaR-based surcharges or cross-product IM escalations.\n\r\nSection 6- Market Maker Impact Model\n\r\nMarket makers (MMs) play a pivotal role in absorbing the flows of directional retail order flow, especially in the equity options market. During periods of elevated implied volatility and price acceleration, MMs must delta-hedge aggressively, often exacerbating price swings in the underlying stock. \n\nThe table below models gamma sensitivity — a second-order exposure that reflects how quickly delta changes relative to the stock price — across varying GME prices and implied volatility levels.\n\n(Image 5)\r\n\nGamma increases non-linearly as share price falls and IV rises. This exposes dealers to reflexive hedging loops, particularly in the $20–$40 range where GME has historically seen dense call activity. Below is the gamma sensitivity matrix (proxy model: Gamma ∝ IV / Price²)\n\r\nAs gamma sensitivity intensifies, particularly in high-IV/low-price regimes, MMs may be forced into a hedging death spiral — selling into dips and buying into rips. This reactive behavior fuels volatility rather than suppresses it, especially in names like GME with concentrated open interest at round-number strikes.\n\n\n\r\nSection 7-ETF Collateral Flow Modeling\n\n\r\nExchange-traded funds (ETFs) with exposure to GameStop (GME) vary dramatically in their market structure and impact on the underlying float. This section models three representative ETFs — XRT, IGME, and  — that have gained notoriety for their disproportionate association with GME volatility and retail sentiment.\r\nCritically, the exposure mechanics differ:\r\n- XRT is a traditional ETF that holds physical shares of GME within a diversified retail index. Creations/redemptions directly impact GME’s float.\r\n- IGME and other GME ETF's do not hold direct GME shares. Instead, they utilize synthetic exposure via derivatives (total return swaps, futures, options). While they do not purchase GME shares outright, their demand can still influence price through dealer hedging obligations.\r\n\r\nBelow is the adjusted modeling table:\r\n\n(Image 6)\n\r\nConclusion: Only XRT exerts direct float pressure on GME via ETF flow mechanics. However, IGME can contribute meaningfully to market-maker hedging reflexes, especially when volatility spikes. Their derivatives-driven architecture creates a feedback loop where investor inflows → swap demand → dealer hedging → upward GME price momentum.\r\nSection VIII: Reflexive Impact on GME IV and Price\n\n\nSection8- Reflexive Impact on GME IV and Price\n\r\nThe exposure models presented in this report suggest a tightly coupled reflexive loop between dealer hedging, ETF synthetic demand, and implied volatility levels in GME. As information about margin spikes, ETF derivative exposure, and options pressure becomes publicly understood — particularly by activist retail investors — market participants may begin to front-run or defensively hedge against these dynamics. This creates a new meta-layer of volatility:\r\n\r\n1. Retail Awareness of Margin Rules: Public discussions of increased CFTC cleared margin requirements and their link to delta/gamma spikes can cause anticipatory call buying or hedging from institutions.\n\r\n2. Reflexive Feedback Loops: The act of modeling volatility triggers (like in this paper) can itself become a volatility driver. Dealers may adjust hedge ratios more quickly, increasing gamma compression.\n\r\n3. Options Market Predictive Signaling: If GME’s IV increases sharply while price remains stable, it may indicate dealer stress, hidden flow imbalance, or anticipatory positioning ahead of squeeze mechanics.\n\r\n4. Narrative-Driven Price Elasticity: The more retail and institutional actors believe margin rules or ETF flows will cause dislocation, the more they may amplify them. Price response to flows becomes nonlinear — a self-fulfilling prophecy.\n\r\nAs reflexive behavior intensifies, gamma bands collapse and GME becomes highly sensitive to even modest volume surges.\n\n\r\nSection IX- JESXSC Synthetic Forward Contract Analysis\n\r\nThe JESXSC classification under ISO 20022 identifies equity-linked forward contracts with non-standard payout structures. These synthetic contracts use spread-based triggers and cash settlement logic to gain performance exposure without direct share ownership.\r\n\r\nKey findings from recent metadata (July 2025) include:\r\n- Two contracts referencing bath and GME with identical structure and synchronized timestamps.\r\n- Use of ReturnOrPayoutTrigger: Spread-bet – a trigger mechanism tied to relative price movements (e.g., AMZN crossing $220).\r\n- DeliveryType: CASH – confirming these instruments settle in fiat, not stock.\r\n\r\nThese findings indicate that synthetic forward structures were likely used to offload risk from failed shorts (e.g., bath) and re-express exposure through new tickers (e.g., GME). The link between their metadata timestamps suggests coordinated creation or lifecycle management as part of a larger synthetic unwind strategy.\r\n\r\nThis analysis reinforces the hypothesis that performance-based triggers, especially around quarterly swap reset dates, could catalyze forced cash settlements and downstream market impacts on GME volatility, options flow, and IV expansion.\r\n\r\n \r\nX. Forward-Looking Trigger Forecast (August 2025)\r\nOver the next 30 days, a convergence of structural fragility and price sensitivity will likely catalyze a volatility event in GameStop (GME), particularly if price exceeds key trigger zones ($36, $41, $49). Based on current margin models, synthetic derivative exposure, and CFTC escalation bands:\r\n\r\n- Probability of margin multiplier escalation >1.15 in futures/CDS: 72%\r\n- Probability of IV surging above 300%: 68%\r\n- Probability of ETF derivative hedging pressure: 80%\r\n- Probability of options gamma compression initiating reflexive feedback loop: 60–75%\r\n- Estimated GME price range by late August (under stress loop): $48–$65\r\n- Estimated IV (avg across expirations): 340%+\r\n\r\nWe believe JESXSC payout triggers may activate if external benchmarks (e.g., AMZN > $220 or bath derivatives auto-expire) force a conversion. When this occurs, collateral obligations in fiat will drive underlying delta adjustments — with GME as the absorption vehicle.\r\n\r\nIn activist terms: The ammunition has been loaded. The fuse is IV. The spark will be a trigger breach.\n\r\n📌 TL;DR – Why Today’s Setup May Be the Trigger\r\nThe stage is set. GameStop’s relatively low market price, combined with depressed Implied Borrow Rates (IB), has masked a dangerous equilibrium: the synthetic short structures have yet to unwind.\r\n\r\n🔻 1. Low Price = Pressure Valve:\r\nAt suppressed prices, synthetic forwards (e.g., JESXSC contracts) and hidden short exposures don’t yet demand resolution. But once a trigger — like AMZN crossing $220 — activates payout logic, collateral must move.\r\n\r\n📈 2. Forward Contracts Are Now Live:\r\nConfirmed CFI metadata from July 1st shows active JESXSC derivatives tied to both bath   and GME with synchronized timestamps, cash settlement rules, and spread-bet payout logic. These were built to delay the pain — not prevent it.\r\n\r\n🧨 3. Imminent Conversion Mechanics:\r\nWith the underlying vehicles (e.g., DK Butterfly Trust) now legally structured to offload obligations, any price rise, IV spike, or external benchmark crossing will begin settlement — and GME is the absorption ticker.\r\n\r\n🧠 4. IV, ETF pressure, and margin models are converging:\r\nCombined with elevated margin modeling from the CFTC and IM increases on futures & CDS, a recursive loop may form — one that converts latent derivatives into active buying pressure.\r\n\r\n💥 Conclusion:\r\nAll that's missing is ignition. The structures are armed. The documents are filed. GME’s low float and high DRS make it uniquely vulnerable to reflexive price movement.\n\n\r\nReferences\n\r\nCFTC Cleared Margin Reports – June 2025. Source: CFTC.gov\n\r\nSEC Form NPORT and XRT ETF filings – Bloomberg Terminal & ETFdb.com\n\r\nRoundhill MEME ETF (IGME) methodology summary – RoundhillInvestments.com\n\r\nVolatility & Gamma Exposure Frameworks – Squeezemetrics.com\n\r\nTotal Return Swaps & Synthetic ETF Structures – ISDA Whitepaper, 2023\n\r\n“Options Flow Impact on Meme Stocks” – CFA Research Institute, 2024\r\n\r\n\n\nAppendix A: Reference Data, Glossary, and Sources\n\r\nGlossary of Terms\n\r\nJESXSC: ISO 10962 CFI code for non-standard equity forward contracts.\n\r\nIV (Implied Volatility): A measure of expected future volatility derived from option prices.\n\r\nTRS (Total Return Swap): A derivative that allows one party to gain exposure to an asset without owning it.\n\r\nCDS (Credit Default Swap): A financial derivative that functions as insurance against credit events.\n\r\nCFTC IM Multiplier: Initial margin multiplier required by the Commodity Futures Trading Commission.\n\r\nFlex Option: A customizable options contract traded OTC with flexible terms.\n\r\nISIN: International Securities Identification Number used to uniquely identify securities.\n\r\nCFI Code: Classification of Financial Instruments code — used to categorize security types.\n\r\r\nKey References and Data Sources\n\r\n• CFTC Cleared Margin Reports – https://cftc.gov\n\r\n• SEC S7-32-10 Comment File – https://www.sec.gov/comments/s7-32-10\n\r\n• OpenFIGI Lookup – https://openfigi.com\n\r\n• ANNA Derivatives Service Bureau – https://www.anna-dsb.com\n\r\n• GLEIF CFI Registry – https://www.gleif.org\n\r\n• ISO 10962 Standard Documentation\n\r\n• Safari.pdf: Structural analysis of TRS and synthetic derivatives\n\r\n• GME & bath ISIN Metadata Snapshots (JESXSC classification)\r\n",
    "created_utc": 1753343601.0,
    "score": 283,
    "num_comments": 35,
    "author": "DegenateMurseRN",
    "url": "https://www.reddit.com/gallery/1m7ybc2",
    "permalink": "/r/GME/comments/1m7ybc2/the_fuse_is_lit_gmes_synthetic_derivatives_margin/",
    "timestamp": "2025-07-24T07:53:21Z",
    "ticker": null
  },
  {
    "id": "1m7v52s",
    "subreddit": "GME",
    "title": "GameStop is ready to blast off at any moment!! $GME",
    "selftext": "",
    "created_utc": 1753332194.0,
    "score": 516,
    "num_comments": 65,
    "author": "Mikimak",
    "url": "https://v.redd.it/7v52ts7m4ref1",
    "permalink": "/r/GME/comments/1m7v52s/gamestop_is_ready_to_blast_off_at_any_moment_gme/",
    "timestamp": "2025-07-24T04:43:14Z",
    "ticker": null
  },
  {
    "id": "1m88v2h",
    "subreddit": "GME",
    "title": "Parody of bureaucracy vs the staple power",
    "selftext": "The power of staple against bureaucracy Trying to present some document, not possible withoit GME staple. Real as life itself. Funny. In Spanish\n\nhttps://www.instagram.com/reel/DLiFK-rCx0j/?igsh=MTlkdXNhZml6d3JiYg==\n",
    "created_utc": 1753374067.0,
    "score": 23,
    "num_comments": 1,
    "author": "GMEstonkix",
    "url": "https://www.reddit.com/r/GME/comments/1m88v2h/parody_of_bureaucracy_vs_the_staple_power/",
    "permalink": "/r/GME/comments/1m88v2h/parody_of_bureaucracy_vs_the_staple_power/",
    "timestamp": "2025-07-24T16:21:07Z",
    "ticker": null
  },
  {
    "id": "1m7t8xe",
    "subreddit": "GME",
    "title": "How badly do they need liquidity? IGME & GMEU are both created 2 months apart...",
    "selftext": "",
    "created_utc": 1753326231.0,
    "score": 207,
    "num_comments": 16,
    "author": "PretendSet9704",
    "url": "https://www.reddit.com/gallery/1m7t8xe",
    "permalink": "/r/GME/comments/1m7t8xe/how_badly_do_they_need_liquidity_igme_gmeu_are/",
    "timestamp": "2025-07-24T03:03:51Z",
    "ticker": null
  },
  {
    "id": "1m7wr8r",
    "subreddit": "GME",
    "title": "492 of the last 781 trading days with short volume above 50%.Yesterday 43.82%⭕️30 day avg 50.47%⭕️SI 71.88M⭕️",
    "selftext": "",
    "created_utc": 1753337796.0,
    "score": 94,
    "num_comments": 2,
    "author": "Affectionate_Use_606",
    "url": "https://www.reddit.com/gallery/1m7wr8r",
    "permalink": "/r/GME/comments/1m7wr8r/492_of_the_last_781_trading_days_with_short/",
    "timestamp": "2025-07-24T06:16:36Z",
    "ticker": null
  },
  {
    "id": "1m81s3u",
    "subreddit": "GME",
    "title": "r/GME Megathread for Thursday July 24th",
    "selftext": "Good Morning Everyone! It’s an interesting time for the basket stocks, KOSS absolutely shot up yesterday when trading opened, and usually when it rips up GameStop follows sometime over the next week. The trading activity around some of the other basket stocks makes me think we might be close to one of those casual rips where GME doubles in price and the media says nothing. Just speculating, I could be completely wrong. ",
    "created_utc": 1753356262.0,
    "score": 35,
    "num_comments": 9,
    "author": "G_Wash1776",
    "url": "https://www.reddit.com/r/GME/comments/1m81s3u/rgme_megathread_for_thursday_july_24th/",
    "permalink": "/r/GME/comments/1m81s3u/rgme_megathread_for_thursday_july_24th/",
    "timestamp": "2025-07-24T11:24:22Z",
    "ticker": null
  },
  {
    "id": "1m7qq4w",
    "subreddit": "GME",
    "title": "Quick Math",
    "selftext": "There are 1.15 million apes on superstonk and GME. Let’s say a lowball average of 100 shares per ape. That equals 115,000,000 worth of shares total out of the 447 million float. Apes are holding strong and keep adding to their war chests. The inevitable will happen one day. Rk was right that he likes the stock and so do I.",
    "created_utc": 1753318904.0,
    "score": 207,
    "num_comments": 70,
    "author": "_KanyeNorthEast_",
    "url": "https://www.reddit.com/r/GME/comments/1m7qq4w/quick_math/",
    "permalink": "/r/GME/comments/1m7qq4w/quick_math/",
    "timestamp": "2025-07-24T01:01:44Z",
    "ticker": null
  },
  {
    "id": "1m7df86",
    "subreddit": "GME",
    "title": "Stopped watching price action about a week ago.",
    "selftext": "That's it, we all have our own version of rks gamestop theory depicted for ourselves. For now, I've set price alerts and im going to say the famous words \"Set it and Forget it\" \n\nIf you're in, you're in. \nIf you're out, then so be it. \n\nIm sure you've heard the saying \"Price is an illusion\" \nIt truely is an illusion.\n\nI log on my exchanges every few days to buy a couple more shares. I have a % of my shares DRS'd and plan to keep doing so. But I buy at whatever price it's at. Because at the end of the day, Ryan Cohen doesn't do what he does to be number 10 in the industry he is working in. He does what he does to be number 1 in the Industry he's in. Roaring Kitty didn't spend numerous years working on this theory to just turn his back on it. We also have to remember roaring kitty isn't a time traveler. He can't predict the future to a T. He can make theories on when things will happen, but in order for those things to happen, other crucial machines that run this earth need to be aligned correctly, for these things to happen.  That's why we've always said \"no dates\" because, RK is not a fortune teller, not a time traveler, but understands and understood what needs to be done and how it can be done. \n\nI have been buying shares since a couple months before the first sneeze, sold 0 shares on the first sneeze and have been keeping my nose pointed in the same direction ever since, adding more shares. I will add that I have gotten wrecked on all my calls, not gonna lie. (No more options for me) \n\nThere are some bearish theories out there and I choose to ignore them. That's my choice. Because I know, that after this long, after all the work and research done, partnerships that have never ended, ideas that haven't fully hit the pavement yet and I just truely beleive it's because of the state of the world today. Political chaos, war, inflation, and just down right uncertainty for what the future holds for ANYONE. \nBut I know whats waiting at the horizon for me \n(and all of us who continue to hold) \n\nI just know, in my future, I still HODL $GME\nI'm never fucking leaving. \nMy conviction is stronger than ever. \nHope my words make some others feel the same way. \nThis may be taking longer than we all hoped, but at the end of the tunnel, there is a tad bit of freedom waiting for us (for sure) and the rest of the world. (Hopefully) \n\n\n**KEY NOTES TO NOT FORGET**\n-Gamestop never ended partnerships with $imx and $lrc , one is a blockchain gaming developing platform and one is to massively scale transactions on layer 2. \n- Shorts have not covered and continue to short \n- Retail continues to buy the stock despite the shorts continuing to short. \n- Ryan Cohen said \"Let them short\" in recent financial news\n- RKs pinned tweet is a reference to waiting. I don't care how people see it, the dog waits for the owner to come back. This is about being loyal to what we know and what we want to change. \n- Rc is sitting on billions of dollars and hundreds of millions in  $btc \n- RC doesn't share his real strategy. Because it's dumb to show your hand at a poker game. Same thing with this.\n\nHead up, solider. 🍻🪖🎖\n\nDon't back down from making the 🏰🩸dry\nHF Liquidations will ensue. \nGood day to you. ",
    "created_utc": 1753287006.0,
    "score": 559,
    "num_comments": 45,
    "author": "buckydunontherun",
    "url": "https://i.redd.it/vl7nislfenef1.jpeg",
    "permalink": "/r/GME/comments/1m7df86/stopped_watching_price_action_about_a_week_ago/",
    "timestamp": "2025-07-23T16:10:06Z",
    "ticker": null
  },
  {
    "id": "1m7nezq",
    "subreddit": "GME",
    "title": "The start of the catalyst ? Kk",
    "selftext": "I know I know everything is the catalyst right ? Ryan cohen is, the kitty is, yatta yatta. But wow the fastest selling hardware in history is wild, and our favorite stock took advantage of that. Makes me very proud. \n\n•\n\n-If you care about an investor/customers current experience at a GameStop near them -\n\n•\n\nI can not stop going to the GameStop near me, they just redid their store and damn does it look good. A way higher inventory of trading cards, lots of new glass display with PSA graded cards, junk products heaping in the back are now gone. I also noticed higher in inventory-more diverse Lego sets😍 Today I heard a customer say to the employee, “it’s like im a kid in the candy store”. I would feel weird walking in to admire the new layout without buying anything so I purchase a capy-buddy every time I go in. \n\nHas anyone else noticed a change near them or are anticipating a redesign in the near future ?\n\n\nI think this next earnings report is going to be fucking nuts 🥜 \n\nAlso don’t forget-Buy, hold, buy, hold, buy buy buy and hold\n\n",
    "created_utc": 1753309964.0,
    "score": 152,
    "num_comments": 10,
    "author": "littleshit569",
    "url": "https://i.redd.it/qgddji7papef1.jpeg",
    "permalink": "/r/GME/comments/1m7nezq/the_start_of_the_catalyst_kk/",
    "timestamp": "2025-07-23T22:32:44Z",
    "ticker": null
  },
  {
    "id": "1m7nsqx",
    "subreddit": "GME",
    "title": "🔮 GameStop Email: \"🍌 🦍 It’s Bananza! B-A-N-A-N-Z-A! Buy Donkey Kong Bananza today!\" 🔥💥🍻",
    "selftext": "# LINK: [https://www.gamestop.com/video-games/nintendo-switch-2/products/donkey-kong-bananza---nintendo-switch-2/424546.html](https://www.gamestop.com/video-games/nintendo-switch-2/products/donkey-kong-bananza---nintendo-switch-2/424546.html)",
    "created_utc": 1753310921.0,
    "score": 112,
    "num_comments": 2,
    "author": "Expensive-Two-8128",
    "url": "https://i.redd.it/ogobc2iidpef1.png",
    "permalink": "/r/GME/comments/1m7nsqx/gamestop_email_its_bananza_bananza_buy_donkey/",
    "timestamp": "2025-07-23T22:48:41Z",
    "ticker": null
  },
  {
    "id": "1m7rnu3",
    "subreddit": "GME",
    "title": "Gamestop advertisement",
    "selftext": "Yo gamestop fam give me real feedback. We just have fun but dope clips happen from time to time. Whats your honest feedback? These a20 Logitech headphones from gamestop are the tits! 💚 \n\nTl:dr bo6 Dark matter, good clips, shameless plug, a20 headphones",
    "created_utc": 1753321546.0,
    "score": 57,
    "num_comments": 2,
    "author": "TheModernSkater",
    "url": "https://youtube.com/shorts/-hgxkyHFD4s?si=bXpPlKN48isMfuFa",
    "permalink": "/r/GME/comments/1m7rnu3/gamestop_advertisement/",
    "timestamp": "2025-07-24T01:45:46Z",
    "ticker": null
  },
  {
    "id": "1m7ftqi",
    "subreddit": "GME",
    "title": "Senate Banking Report, Dodd Frank: \"The record of the SEC's [Consolidated Supervised Entities] CSEs programs must certainly stand as among the greatest regulatory failures in financial history...\" | [2025 SEC Chairman Paul Atkins was 1 of 5 SEC Members between 2004-2008 who ran the CSE program]",
    "selftext": "",
    "created_utc": 1753292461.0,
    "score": 208,
    "num_comments": 4,
    "author": "ringingbells",
    "url": "https://i.redd.it/swhlu8s4unef1.png",
    "permalink": "/r/GME/comments/1m7ftqi/senate_banking_report_dodd_frank_the_record_of/",
    "timestamp": "2025-07-23T17:41:01Z",
    "ticker": null
  },
  {
    "id": "1m7hb0n",
    "subreddit": "GME",
    "title": "Meme Stocks rocketing and index funds hitting new all time highs. GME, you’re not coming.",
    "selftext": "",
    "created_utc": 1753295793.0,
    "score": 170,
    "num_comments": 26,
    "author": "mrbell84",
    "url": "https://i.redd.it/8gs1qkbk4oef1.jpeg",
    "permalink": "/r/GME/comments/1m7hb0n/meme_stocks_rocketing_and_index_funds_hitting_new/",
    "timestamp": "2025-07-23T18:36:33Z",
    "ticker": null
  },
  {
    "id": "1m7qvp3",
    "subreddit": "GME",
    "title": "[S4:E94] The Golden Pinecone Daily Tournament (July 24st 2025)",
    "selftext": "https://preview.redd.it/9osh0ue22qef1.png?width=512&format=png&auto=webp&s=785d99ab9862a18a98beb37e10d72b3e0d621dcd\n\nThe Rules are simple: =================================================\n\n\\-To Win: Guess the closest to the closing daily price for GME. (the final settled price, not including After-hours trading) Guess must be in by 10:30am EST (NYT). (One hour after the opening bell)\n\n\\-An exact guess AKA the Bullseye Crew you get 2 cones for the season total standings. The count for the Bullseye Crew is just the exact number of Bullseyes this season per player.\n\n* In the result of a tie, both win a cone as both were correct.\n\n\\-No Edits: your guess is your guess, and once it is in, it cannot be changed. Early bird gets the guess. (if you edit your guess, you are disqualified for that day, sorry). If you notice your guess has already been taken, do not edit your guess but comment underneath it. At that point you can make a new guess but it still has to be in by 10:30 EST (One hour after the opening bell)\n\n\\-B2B Sniping Rule: Last guess of the day cannot win on back to back days. All guesses must be in USD amounts.\n\n\\-The seasonal standings are below the closing score and yesterday's winner. The winners circle is the hall of fame of past season winners. This is for the player with the most total wins per season. There are 250 games per season we play every day the market is trading.\n\n============================================\n\n\\*WINNERS CIRCLE\n\nSeason 1 Winner: Lorien6 ( 31 Wins )\n\nSeason 2 Winner: Bloodshot\\_Blinkers ( 34 Wins )\n\nSeason 3 Winner: isthatfair1234 ( 22 wins )\n\n**CLOSING PRICE**: $23.96\n\n**Winning Guesses:** $23.78 roswelljack\n\n**Notes:** dance around the room..... dance around the room..... first cone for you.... dance around the room..... \n\n==== Season 4 Cone Winners ====\n\nisthatfair1234 (17)\n\ncyberpunkjay3243 (12)\n\nTallfeel (9)\n\nHeynow 846 (7)\n\nMusesoutloud (7)\n\navspuk (6)\n\nG\\_Wash1776 (5)\n\nExpensive-Two-8128 (4)\n\nstockmarketscam-617 (4)\n\nStevefstorms (4)\n\nGlobetrotting22 (4)\n\nNeilsberry427 (3)\n\ntendie\\_mcnuggets (3)\n\nWalrusSoliloquy (2)\n\nPrestigious\\_Ebb3167 (1)\n\neciptic10 (1)\n\ncosmotropik (1)\n\nLongjumping\\_Wash9556 (1)\n\nPhat\\_Kitty\\_ (1)\n\nDustey-CSK1 (1)\n\nLeftnutbrown (1)\n\nDynastyFSU2 (1)\n\nsyoung907 (1)\n\nMikeman1971 (1)\n\nBiggJermm (1)\n\nTLDCrafty (1)\n\n6\\_Pat (1)\n\nroswelljack (1)\n\n=== Bullseye Crew S4 ===\n\ncyberpunkjay3243 (2)\n\nisthatfair1234 (1)\n\nGlobetrotting22 (1)\n\nHeyNow846 (1)\n\ntallfeel (1)\n\navspuk (1)\n\nExpensive-Two-8128 (1)",
    "created_utc": 1753319341.0,
    "score": 31,
    "num_comments": 34,
    "author": "stevefstorms",
    "url": "https://www.reddit.com/r/GME/comments/1m7qvp3/s4e94_the_golden_pinecone_daily_tournament_july/",
    "permalink": "/r/GME/comments/1m7qvp3/s4e94_the_golden_pinecone_daily_tournament_july/",
    "timestamp": "2025-07-24T01:09:01Z",
    "ticker": null
  },
  {
    "id": "1m7fy5z",
    "subreddit": "GME",
    "title": "Been Holding - Ready to Start Growing xxx holder",
    "selftext": "Okay so I've been accumulating GME share for what feels like 84 yrs but I really want to start making a little extra $$$ here and there. I have 100 shares DRS'd that I clearly have forgotten about and 200 share in my trading account. \n\nWhat's a good strategy to make some passive income (any income) using the 200 shares, I also have about 1k in Buying Power?\n\nCovered Calls / Cash Secured Puts \n\n\\*Just a regard who needs a lil guidance ",
    "created_utc": 1753292742.0,
    "score": 48,
    "num_comments": 4,
    "author": "GoldApe824",
    "url": "https://www.reddit.com/r/GME/comments/1m7fy5z/been_holding_ready_to_start_growing_xxx_holder/",
    "permalink": "/r/GME/comments/1m7fy5z/been_holding_ready_to_start_growing_xxx_holder/",
    "timestamp": "2025-07-23T17:45:42Z",
    "ticker": null
  },
  {
    "id": "1m7ggif",
    "subreddit": "GME",
    "title": "The Dog Days of Summer, traditionally defined as a period of hot and humid weather, end on August 11th…",
    "selftext": "How does this change your thinking as far as the Roaring Kitty meme is concerned, since we haven’t MOASS yet… have we not gotten passed the dog 🐶 emoji? I’m pretty sure we were all under the impression that $GME was circling around the crash 💥 emoji and ready to retire!!! 🍻",
    "created_utc": 1753293874.0,
    "score": 41,
    "num_comments": 30,
    "author": "JAWilkerson3rd",
    "url": "https://i.redd.it/ttwcxwsuynef1.jpeg",
    "permalink": "/r/GME/comments/1m7ggif/the_dog_days_of_summer_traditionally_defined_as_a/",
    "timestamp": "2025-07-23T18:04:34Z",
    "ticker": null
  },
  {
    "id": "1m71exj",
    "subreddit": "GME",
    "title": "Are we ready to visit old friend 25",
    "selftext": "",
    "created_utc": 1753250304.0,
    "score": 297,
    "num_comments": 18,
    "author": "Mipetsu",
    "url": "https://i.redd.it/mf8ko0tadkef1.jpeg",
    "permalink": "/r/GME/comments/1m71exj/are_we_ready_to_visit_old_friend_25/",
    "timestamp": "2025-07-23T05:58:24Z",
    "ticker": null
  },
  {
    "id": "1m72xyi",
    "subreddit": "GME",
    "title": "492 of the last 780 trading days with short volume above 50%.Yesterday 45.49%⭕️30 day avg 50.73%⭕️SI 73.46M⭕️",
    "selftext": "",
    "created_utc": 1753256110.0,
    "score": 108,
    "num_comments": 2,
    "author": "Affectionate_Use_606",
    "url": "https://www.reddit.com/gallery/1m72xyi",
    "permalink": "/r/GME/comments/1m72xyi/492_of_the_last_780_trading_days_with_short/",
    "timestamp": "2025-07-23T07:35:10Z",
    "ticker": null
  },
  {
    "id": "1m6owct",
    "subreddit": "GME",
    "title": "10.5 QUADRILLION DOLLAR Market Cap?! 1,000,000x glitch? Barclays 🚀",
    "selftext": "[https://research-centre.barclays.co.uk/shares/gamestop-corp-class-a-cdi](https://research-centre.barclays.co.uk/shares/gamestop-corp-class-a-cdi)\n\nAny reason why it would show 1,000,000 the real market cap? lol",
    "created_utc": 1753215413.0,
    "score": 878,
    "num_comments": 91,
    "author": "ufos1111",
    "url": "https://i.redd.it/58h9i0szghef1.png",
    "permalink": "/r/GME/comments/1m6owct/105_quadrillion_dollar_market_cap_1000000x_glitch/",
    "timestamp": "2025-07-22T20:16:53Z",
    "ticker": null
  },
  {
    "id": "1m6sjej",
    "subreddit": "GME",
    "title": "GME SHARE PRICE IS GLITCHING",
    "selftext": "Holding 19,815 shares of gme caused my P&L to glitch to +101,400%\n\n👀  market manipulation at its best.\nSomething is cooking behind the scenes.\n\n🚀 gme gme gme🚀 gme gme gme🚀 gme gme gme🚀 gme gme gme🚀 gme gme gme🚀 gme gme gme🚀 gme gme gme🚀 gme gme gme🚀 gme gme gme🚀 gme gme gme🚀 gme gme gme🚀 gme gme gme🚀 gme gme gme🚀 gme gme gme🚀 gme gme gme\n",
    "created_utc": 1753224136.0,
    "score": 440,
    "num_comments": 38,
    "author": "Hennesseyandrice",
    "url": "https://www.reddit.com/gallery/1m6sjej",
    "permalink": "/r/GME/comments/1m6sjej/gme_share_price_is_glitching/",
    "timestamp": "2025-07-22T22:42:16Z",
    "ticker": null
  },
  {
    "id": "1m76rf4",
    "subreddit": "GME",
    "title": "r/GME Megathread for Wednesday July 23rd",
    "selftext": "Good Morning Everyone! GameStop continues its steady climb upwards, I expect it will continue to push upwards back towards $30. Either way this is a great price to buy more shares and get that average cost down if yours is a little higher then you want. ",
    "created_utc": 1753270258.0,
    "score": 36,
    "num_comments": 11,
    "author": "G_Wash1776",
    "url": "https://www.reddit.com/r/GME/comments/1m76rf4/rgme_megathread_for_wednesday_july_23rd/",
    "permalink": "/r/GME/comments/1m76rf4/rgme_megathread_for_wednesday_july_23rd/",
    "timestamp": "2025-07-23T11:30:58Z",
    "ticker": null
  },
  {
    "id": "1m704or",
    "subreddit": "GME",
    "title": "Check out the GameStop ex post from this evening. Look in the background those games aren’t just random.",
    "selftext": "First off, shoutout to Mike Hands—the man with the \"hands\" that's got the community buzzing. With GME's “reported” short interest still hovering at 25-30% of the float, per recent data, this timing? Chef's kiss.\n\nThe lineup starts strong with battle-themed games like Army of Two, Battlefield: Bad Company, and Assassin's Creed Valhalla. Picture this: misfit soldiers (us apes) forming an \"army of two\" to take down corrupt corporations in chaotic wars. Valhalla's Viking raids? That's retail storming Wall Street, assassinating short positions stealthily for that sweet Valhalla payoff. Tie in Watch Dogs: Legion (emphasized twice for a reason)—a legion of hackers recruiting citizens to hack surveillance overlords and spark uprisings. Sound familiar? It's the ape legion exposing naked shorts and DRS-ing shares to overthrow hedgie control. Set in a dystopian 2030s, but feels like now with all the market manipulation drama. \n\nThen we hunt and trap: Big Game Hunter tracking apex predators (big shorts like Citadel), Goat Simulator's chaotic GOAT (Greatest Of All Time—Cohen or Roaring Kitty?) flipping the script so shorts get wrecked, and Marvel's Spider-Man webbing up villains in a squeeze they can't escape. Add Titanfall 2: a lowly rifleman bonds with a massive Titan mech to dismantle an interstellar corp exploiting the frontier. Underdog apes calling in \"titans\" like earnings catalysts to crush overleveraged bears—time's up for their \"fall.\" Gameplay's fast, vertical chaos? That's GME volatility spiking. \n\nCrime and exposure ramp up with GTA's heists satirizing greed (retail \"stealing\" gains via squeeze), True Crime's undercover cop unraveling mafia corruption (exposing illegal shorting), and Mortal Kombat 1's rebooted universe where underdogs deliver fatal blows in tournaments. Liu Kang resetting timelines for a new era? That's Cohen architecting GME's turnaround, ending with brutal Fatalities on shorts. The Definitive Edition's chaos and deception? Mirrors the dark pool games we're seeing today. Speaking of which... \n\nCheck this block trade tape lighting up: Massive dark pool buys at $24.10 (ask) and $23.88 (bid), institutional whales accumulating pre-breakout. \"Someone was accumulating below the breakout zone then hit the gas... it’s a transfer of power. Smart money’s loading. Shorts are realizing it.\nAnd volatility? \"Put IV just overtook Call IV... positive vanna + dealer buying = grinding bid unlikely to be stopped. Targets: $25, then $27+.\n\nApe vibes seal the deal: Donkey Kong's barrel-throwing primate (apes strong together!), Super Mario Party's mini-game rivalries collecting stars (post-squeeze gains), and Super Mario 3D World's co-op rescues with power-ups (3D chess strategy leading to world domination). Now toss in Super Mario Party Jamboree: a festive trek planning the ultimate party, gathering items across boards to thwart Bowser (shorts). The Switch 2 bundle with Jamboree TV? Media exposure for the big celebration. It's all building to a jamboree blowout after the quests (hold through volatility) are done. \n\nTechnicals are screaming bullish too. \"With CCI overbought, RSI neutral, bollingers pinching, and convertible note arbitrage—we have a 'Shaft Squeeze' pattern. Extremely Bullish $GME. Could blow any day no. P rice flipping green last minute: \"This shit gonna run. I can feel it in my monkey nuts. \n\nThe narrative arc is crystal: Armies battle bad actors (setup the war), hunt/trap with chaos (execute the plan), heist/expose crimes (climax the exposure), deliver mortal finishes (decisive win), and party like jamboree champs (victory lap). WWE belt in the center? Apes as undisputed kings post-MOASS. With GME's $4B cash hoard, low debt, and catalysts like Switch 2 and Pokémon drops, this video's a wink from inside. Mike Hands is the hero signaling unity—diamond hands trigger the squeeze.\n",
    "created_utc": 1753245806.0,
    "score": 113,
    "num_comments": 16,
    "author": "DegenateMurseRN",
    "url": "https://i.redd.it/par08hbxzjef1.jpeg",
    "permalink": "/r/GME/comments/1m704or/check_out_the_gamestop_ex_post_from_this_evening/",
    "timestamp": "2025-07-23T04:43:26Z",
    "ticker": null
  },
  {
    "id": "1m766vl",
    "subreddit": "GME",
    "title": "A thought on cycles and requels",
    "selftext": "Haven’t seen this before but I’ve been thinking about it so figured I’d share for discussion. Don’t have enough xp for the big sub but whatever. \n\nAt the end of the squeeze in April 2021, RK exercised options to buy 50k additional GME shares bringing him up to around 200k total. Fast forward to June 2024 he owned 9 million shares. Thats a 45x increase in basically 3 years (38-ish months). \n\nNow, the way that financial gains work, it takes money to buy whiskey: the more money you have, the more money you can make, faster, with the same strategies. If you had a cycle and strategy you know worked and you increased your position 45x through options etc in basically 3 years, you could potentially do that again in another three years, assuming your strategy held and your balls we’re big enough. \n\nThe public float is 408 million shares. If RK would 45x his last known 9M position that would bring him to…405 million. If it took him the same time period to do so, that would be August of 2027. And while RC did dilute initially to raise capital, lately he’s been issuing convertible bonds. Those first bonds don’t have the possibility of converting and increasing the total shares outstanding until 2030…well after the time period it would theoretically take for RK to literally lock the float if my previous statement is true. \n\nNot saying I’m hoping it takes that long or am trying to provide fake hype dates but just a thought I had. Tell me why I’m regarded. \n\nEdit: I’ve been reminded of the stock split in 2022. That would put RK at roughly 800k shares meaning he roughly 10x his position by June 2024. By that rate of growth, it would take 4.5ish years to lock the float or around December 2028. ",
    "created_utc": 1753268452.0,
    "score": 30,
    "num_comments": 20,
    "author": "shadowswimmer77",
    "url": "https://www.reddit.com/r/GME/comments/1m766vl/a_thought_on_cycles_and_requels/",
    "permalink": "/r/GME/comments/1m766vl/a_thought_on_cycles_and_requels/",
    "timestamp": "2025-07-23T11:00:52Z",
    "ticker": null
  },
  {
    "id": "1m6pxcw",
    "subreddit": "GME",
    "title": "🔮 The CEO of Quantum BioPharma already has his answer from RC: “Let ‘em short” — As a $GME shareholder I will never support GameStop joining ANY court cases or class action lawsuits 🪤",
    "selftext": "I’m glad when any CEO of any company buys $GME.\n\nBut under no circumstances (even super solidarity)  would I EVER support GameStop joining ANY court cases or class action lawsuits.\n\nIf that was a good option, RC already would have done it. And the fact that he hasn’t in nearly 5 years is very, very telling.\n\nHow many companies have tried this over the years with all the same lame-duck “serious face” lawyers leading the charge, only to end with absolutely no progress while those lawyers get to “aw shucks, we’ll get ‘em next time!” and make off with the hefty legal fees?\n\n#In Texas we call that grifting.\n\nAnother thing to consider: Andrew Left has recently been quoted as saying he thinks his cases should be tried in civil court, not criminal…now why do you think he might be saying that?\n\n#What the naked shorts did and do to GameStop is fucking criminal- it does not belong in a civil lawsuit, full stop.\n\nIs GameStop the symbol of hope against market corruption? Yes. Well, let’s keep it that way by not falling for what has effectively been a persistent trap over the years.\n\nAny companies that have ever “won” anything in the civil courts has ALWAYS resulted in absolute peanuts for shareholders, everything gets sealed and NDA’d to death, oh, and the fucking perps get to walk away.\n\nNo fucking thank you- I want my “fuck you, pay me” no cell, no sell money, while the $GME naked shorts pull a forced Bernie Madoff.\n\nIt should be obvious to all by now that GameStop must win in the arena of the markets themselves if shareholders (including retail investor Ryan Cohen himself) are to realize the maximum true value for their shares of $GME.\n\nIf Quantum BioPharma CEO wants to win, he and his company must do the same.\n\n#RC said it best: “Let ‘em short”",
    "created_utc": 1753217799.0,
    "score": 408,
    "num_comments": 13,
    "author": "Expensive-Two-8128",
    "url": "https://v.redd.it/5ml5ht2nohef1",
    "permalink": "/r/GME/comments/1m6pxcw/the_ceo_of_quantum_biopharma_already_has_his/",
    "timestamp": "2025-07-22T20:56:39Z",
    "ticker": null
  },
  {
    "id": "1m6gw14",
    "subreddit": "GME",
    "title": "Quantum, the only company with GME on thier balance sheet",
    "selftext": "",
    "created_utc": 1753197527.0,
    "score": 632,
    "num_comments": 35,
    "author": "baseballmal21",
    "url": "https://i.redd.it/q25pyg6d0gef1.jpeg",
    "permalink": "/r/GME/comments/1m6gw14/quantum_the_only_company_with_gme_on_thier/",
    "timestamp": "2025-07-22T15:18:47Z",
    "ticker": null
  },
  {
    "id": "1m6nm6b",
    "subreddit": "GME",
    "title": "Five Investment Banks in the 2004 SEC's Consolidated Supervised Equity Program CSE Program started under then SEC commissioner, now SEC Chair Paul Atkins were: ( 1 ) Lehman ( 2 ) Bear Stearns ( 4 ) Merrill Lynch ( 3 ) Goldman Sachs ( 5 ) Morgan Stanley | CSE ended Sep 28 after Lehman failed Sep 15",
    "selftext": "",
    "created_utc": 1753212524.0,
    "score": 206,
    "num_comments": 17,
    "author": "ringingbells",
    "url": "https://i.redd.it/hcs7agax8hef1.png",
    "permalink": "/r/GME/comments/1m6nm6b/five_investment_banks_in_the_2004_secs/",
    "timestamp": "2025-07-22T19:28:44Z",
    "ticker": null
  },
  {
    "id": "1m6d9dv",
    "subreddit": "GME",
    "title": "Here we go again",
    "selftext": "",
    "created_utc": 1753188703.0,
    "score": 535,
    "num_comments": 18,
    "author": "Mipetsu",
    "url": "https://i.redd.it/0xhzch44afef1.jpeg",
    "permalink": "/r/GME/comments/1m6d9dv/here_we_go_again/",
    "timestamp": "2025-07-22T12:51:43Z",
    "ticker": null
  },
  {
    "id": "1m84ws6",
    "subreddit": "GME",
    "title": "RC, stocks continue to reach new all time highs. What do you have to say to GME investors as they are left behind?",
    "selftext": "",
    "created_utc": 1753364901.0,
    "score": 0,
    "num_comments": 15,
    "author": "mrbell84",
    "url": "https://i.redd.it/u6csipz1utef1.gif",
    "permalink": "/r/GME/comments/1m84ws6/rc_stocks_continue_to_reach_new_all_time_highs/",
    "timestamp": "2025-07-24T13:48:21Z",
    "ticker": null
  },
  {
    "id": "1m6i0o4",
    "subreddit": "GME",
    "title": "We are doomed!",
    "selftext": "",
    "created_utc": 1753200076.0,
    "score": 231,
    "num_comments": 25,
    "author": "GME-Member",
    "url": "https://v.redd.it/0m2m9qok7gef1",
    "permalink": "/r/GME/comments/1m6i0o4/we_are_doomed/",
    "timestamp": "2025-07-22T16:01:16Z",
    "ticker": null
  },
  {
    "id": "1m6x92b",
    "subreddit": "GME",
    "title": "[S4:E93] The Golden Pinecone Daily Tournament (July 23st 2025)",
    "selftext": "https://preview.redd.it/5upavk3r8jef1.png?width=512&format=png&auto=webp&s=95db002b91c7f5036c6ce8fa408443f9df3a6e47\n\nThe Rules are simple: =================================================\n\n\\-To Win: Guess the closest to the closing daily price for GME. (the final settled price, not including After-hours trading) Guess must be in by 10:30am EST (NYT). (One hour after the opening bell)\n\n\\-An exact guess AKA the Bullseye Crew you get 2 cones for the season total standings. The count for the Bullseye Crew is just the exact number of Bullseyes this season per player.\n\n* In the result of a tie, both win a cone as both were correct.\n\n\\-No Edits: your guess is your guess, and once it is in, it cannot be changed. Early bird gets the guess. (if you edit your guess, you are disqualified for that day, sorry). If you notice your guess has already been taken, do not edit your guess but comment underneath it. At that point you can make a new guess but it still has to be in by 10:30 EST (One hour after the opening bell)\n\n\\-B2B Sniping Rule: Last guess of the day cannot win on back to back days. All guesses must be in USD amounts.\n\n\\-The seasonal standings are below the closing score and yesterday's winner. The winners circle is the hall of fame of past season winners. This is for the player with the most total wins per season. There are 250 games per season we play every day the market is trading.\n\n============================================\n\n\\*WINNERS CIRCLE\n\nSeason 1 Winner: Lorien6 ( 31 Wins )\n\nSeason 2 Winner: Bloodshot\\_Blinkers ( 34 Wins )\n\nSeason 3 Winner: isthatfair1234 ( 22 wins )\n\n**CLOSING PRICE**: $24.26\n\n**Winning Guesses:** $24.28 Cyberpunkjay3243\n\n**Notes:** CPJ has been on a heater of late. IsThatFair.... objects in the mirror may be closer than they appear... \n\n==== Season 4 Cone Winners ====\n\nisthatfair1234 (17)\n\ncyberpunkjay3243 (12)\n\nTallfeel (9)\n\nHeynow 846 (7)\n\nMusesoutloud (7)\n\navspuk (6)\n\nG\\_Wash1776 (5)\n\nExpensive-Two-8128 (4)\n\nstockmarketscam-617 (4)\n\nStevefstorms (4)\n\nGlobetrotting22 (4)\n\nNeilsberry427 (3)\n\ntendie\\_mcnuggets (3)\n\nWalrusSoliloquy (2)\n\nPrestigious\\_Ebb3167 (1)\n\neciptic10 (1)\n\ncosmotropik (1)\n\nLongjumping\\_Wash9556 (1)\n\nPhat\\_Kitty\\_ (1)\n\nDustey-CSK1 (1)\n\nLeftnutbrown (1)\n\nDynastyFSU2 (1)\n\nsyoung907 (1)\n\nMikeman1971 (1)\n\nBiggJermm (1)\n\nTLDCrafty (1)\n\n6\\_Pat (1)\n\n=== Bullseye Crew S4 ===\n\ncyberpunkjay3243 (2)\n\nisthatfair1234 (1)\n\nGlobetrotting22 (1)\n\nHeyNow846 (1)\n\ntallfeel (1)\n\navspuk (1)\n\nExpensive-Two-8128 (1)",
    "created_utc": 1753236950.0,
    "score": 32,
    "num_comments": 27,
    "author": "stevefstorms",
    "url": "https://www.reddit.com/r/GME/comments/1m6x92b/s4e93_the_golden_pinecone_daily_tournament_july/",
    "permalink": "/r/GME/comments/1m6x92b/s4e93_the_golden_pinecone_daily_tournament_july/",
    "timestamp": "2025-07-23T02:15:50Z",
    "ticker": null
  },
  {
    "id": "1m6jwjw",
    "subreddit": "GME",
    "title": "🚘 4hr Chart",
    "selftext": "",
    "created_utc": 1753204298.0,
    "score": 166,
    "num_comments": 33,
    "author": "TTBPhotography",
    "url": "https://www.reddit.com/gallery/1m6jwjw",
    "permalink": "/r/GME/comments/1m6jwjw/4hr_chart/",
    "timestamp": "2025-07-22T17:11:38Z",
    "ticker": null
  }
]